[{"Authors": "Z. Barnett-Itzhaki, M. Elbaz, R. Butterman, D. Amar, M. Amitay, C. Racowsky, R. Orvieto, R. Hauser, AA. Baccarelli and R. Machtinger, ", "Title": "\"Machine learning vs. classic statistics for the prediction of IVF outcomes.\", ", "Journal": "Journal of assisted reproduction and genetics ", "Volume": "37(10) ", "Date": "Oct. 2020", "PubmedID": "PUBMED: 32783138; ", "DOI": "DOI 10.1007/s10815-020-01908-1.", "Abstract": "To assess whether machine learning methods provide advantage over classic statistical modeling for the prediction of IVF outcomes."}, {"Authors": "SJ. Gunderson, LC. Puga Molina, N. Spies, PA. Balestrini, MG. Buffone, ES. Jungheim, J. Riley and CM. Santi, ", "Title": "\"Machine-learning algorithm incorporating capacitated sperm intracellular pH predicts conventional in vitro fertilization success in normospermic patients.\", ", "Journal": "Fertility and sterility ", "Volume": "115(4) ", "Date": "Apr. 2021", "PubmedID": "PUBMED: 33461755; ", "DOI": "DOI 10.1016/j.fertnstert.2020.10.038.", "Abstract": "To measure human sperm intracellular pH (pHi) and develop a machine-learning algorithm to predict successful conventional in vitro fertilization (IVF) in normospermic patients."}, {"Authors": "J. Qiu, P. Li, M. Dong, X. Xin and J. Tan, ", "Title": "\"Personalized prediction of live birth prior to the first in vitro fertilization treatment: a machine learning method.\", ", "Journal": "Journal of translational medicine ", "Volume": "17(1) ", "Date": "Sep. 2019", "PubmedID": "PUBMED: 31547822; ", "DOI": "DOI 10.1186/s12967-019-2062-5.", "Abstract": "Infertility has become a global health issue with the number of couples seeking in vitro fertilization (IVF) worldwide continuing to rise. Some couples remain childless after several IVF cycles. Women undergoing IVF face greater risks and financial burden. A prediction model to predict the live birth chance prior to the first IVF treatment is needed in clinical practice for patients counselling and shaping expectations."}]