[{"Authors": "R. Matorras, R. Valls, M. Azkargorta, J. Burgos, A. Rabanal, F. Elortza, JM. Mas and T. Sardon, ", "Title": "\"Proteomics based drug repositioning applied to improve in vitro fertilization implantation: an artificial intelligence model.\", ", "Journal": "Systems biology in reproductive medicine ", "Volume": "67(4) ", "Date": "Aug. 2021", "PubmedID": "PUBMED: 34126818; ", "DOI": "DOI 10.1080/19396368.2021.1928792.", "Abstract": "Embryo implantation is one of the most inefficient steps in assisted reproduction, so the identifying drugs with a potential clinical application to improve it has a strong interest. This work applies artificial intelligence and systems biology-based mathematical modeling strategies to unveil potential treatments by computationally analyzing and integrating available molecular and clinical data from patients. The mathematical models of embryo implantation computationally generated here simulate the molecular networks underneath this biological process. Once generated, these models were analyzed in order to identify potential repositioned drugs (drugs already used for other indications) able to improve embryo implantation by modulating the molecular pathways involved. Interestingly, the repositioning analysis has identified drugs considering two endpoints: (1) drugs able to modulate the activity of proteins whose role in embryo implantation is already bibliographically acknowledged, and (2) drugs that modulate key proteins in embryo implantation previously predicted through a mechanistic analysis of the mathematical models. This second approach increases the scope open for examination and potential novelty of the repositioning strategy. As a result, a list of 23 drug candidates to improve embryo implantation after IVF was identified by the mathematical models. This list includes many of the compounds already tested for this purpose, which reinforces the predictive capacity of our approach, together with novel repositioned candidates (e.g., Infliximab, Polaprezinc, and Amrinone). In conclusion, the present study exploits existing molecular and clinical information to offer new hypotheses regarding molecular mechanisms in embryo implantation and therapeutic candidates to improve it. This information will be very useful to guide future research.Abbreviations: IVF: in vitro fertilization; EI: Embryo implantation; TPMS: Therapeutic Performance Mapping System; MM: mathematical models; ANN: Artificial Neuronal Networks; TNFα: tumour necrosis factor factor-alpha; HSPs: heat shock proteins; VEGF: vascular endothelial growth factor; PPARA: peroxisome proliferator activated receptor-α PXR: pregnane X receptor; TTR: transthyretin; BED: Biological Effectors Database; MLP: multilayer perceptron."}, {"Authors": "G. Letterie and A. Mac Donald, ", "Title": "\"Artificial intelligence in in vitro fertilization: a computer decision support system for day-to-day management of ovarian stimulation during in vitro fertilization.\", ", "Journal": "Fertility and sterility ", "Volume": "114(5) ", "Date": "Nov. 2020", "PubmedID": "PUBMED: 33012555; ", "DOI": "DOI 10.1016/j.fertnstert.2020.06.006.", "Abstract": "To describe a computer algorithm designed for in vitro fertilization (IVF) management and to assess the algorithm's accuracy in the day-to-day decision making during ovarian stimulation for IVF when compared to evidence-based decisions by the clinical team."}, {"Authors": "N. Zaninovic and Z. Rosenwaks, ", "Title": "\"Artificial intelligence in human in vitro fertilization and embryology.\", ", "Journal": "Fertility and sterility ", "Volume": "114(5) ", "Date": "Nov. 2020", "PubmedID": "PUBMED: 33160513; ", "DOI": "DOI 10.1016/j.fertnstert.2020.09.157.", "Abstract": "Embryo evaluation and selection embody the aggregate manifestation of the entire in vitro fertilization (IVF) process. It aims to choose the \"best\" embryos from the larger cohort of fertilized oocytes, the majority of which will be determined to be not viable either as a result of abnormal development or due to chromosomal imbalances. Indeed, it is generally acknowledged that even after embryo selection based on morphology, time-lapse microscopic photography, or embryo biopsy with preimplantation genetic testing, implantation rates in the human are difficult to predict. Our pursuit of enhancing embryo evaluation and selection, as well as increasing live birth rates, will require the adoption of novel technologies. Recently, several artificial intelligence (AI)-based methods have emerged as objective, standardized, and efficient tools for evaluating human embryos. Moreover, AI-based methods can be implemented for other clinical aspects of IVF, such as assessing patient reproductive potential and individualizing gonadotropin stimulation protocols. As AI has the capability to analyze \"big\" data, the ultimate goal will be to apply AI tools to the analysis of all embryological, clinical, and genetic data in an effort to provide patient-tailored treatments. In this chapter, we present an overview of existing AI technologies in reproductive medicine and envision their potential future applications in the field."}, {"Authors": "DP. Patel, KX. Gross and JM. Hotaling, ", "Title": "\"Can artificial intelligence drive optimal sperm selection for inÂ vitro fertilization?,\" ", "Journal": "Fertility and sterility ", "Volume": "115(4) ", "Date": "Apr. 2021", "PubmedID": "PUBMED: 33642063; ", "DOI": "DOI 10.1016/j.fertnstert.2021.02.004.", "Abstract": ""}, {"Authors": "E. Babayev, ", "Title": "\"Man versus machine in in vitro fertilization-can artificial intelligence replace physicians?,\" ", "Journal": "Fertility and sterility ", "Volume": "114(5) ", "Date": "Nov. 2020", "PubmedID": "PUBMED: 32819677; ", "DOI": "DOI 10.1016/j.fertnstert.2020.07.042.", "Abstract": ""}, {"Authors": "C. Siristatidis, S. Stavros, A. Drakeley, S. Bettocchi, A. Pouliakis, P. Drakakis, M. Papapanou and N. Vlahos, ", "Title": "\"Omics and Artificial Intelligence to Improve In Vitro Fertilization (IVF) Success: A Proposed Protocol.\", ", "Journal": "Diagnostics (Basel, Switzerland) ", "Volume": "11(5) ", "Date": "Apr. 2021", "PubmedID": "PUBMED: 33919350; ", "DOI": "DOI 10.3390/diagnostics11050743.", "Abstract": "The prediction of in vitro fertilization (IVF) outcome is an imperative achievement in assisted reproduction, substantially aiding infertile couples, health systems and communities. To date, the assessment of infertile couples depends on medical/reproductive history, biochemical indications and investigations of the reproductive tract, along with data obtained from previous IVF cycles, if any. Our project aims to develop a novel tool, integrating omics and artificial intelligence, to propose optimal treatment options and enhance treatment success rates. For this purpose, we will proceed with the following: (1) recording subfertile couples' lifestyle and demographic parameters and previous IVF cycle characteristics; (2) measurement and evaluation of metabolomics, transcriptomics and biomarkers, and deep machine learning assessment of the oocyte, sperm and embryo; (3) creation of artificial neural network models to increase objectivity and accuracy in comparison to traditional techniques for the improvement of the success rates of IVF cycles following an IVF failure. Therefore, \"omics\" data are a valuable parameter for embryo selection optimization and promoting personalized IVF treatment. \"Omics\" combined with predictive models will substantially promote health management individualization; contribute to the successful treatment of infertile couples, particularly those with unexplained infertility or repeated implantation failures; and reduce multiple gestation rates."}, {"Authors": "Q. Xi, Q. Yang, M. Wang, B. Huang, B. Zhang, Z. Li, S. Liu, L. Yang, L. Zhu and L. Jin, ", "Title": "\"Individualized embryo selection strategy developed by stacking machine learning model for better in vitro fertilization outcomes: an application study.\", ", "Journal": "Reproductive biology and endocrinology : RB&E ", "Volume": "19(1) ", "Date": "Apr. 2021", "PubmedID": "PUBMED: 33820565; ", "DOI": "DOI 10.1186/s12958-021-00734-z.", "Abstract": "To minimize the rate of in vitro fertilization (IVF)- associated multiple-embryo gestation, significant efforts have been made. Previous studies related to machine learning in IVF mainly focused on selecting the top-quality embryos to improve outcomes, however, in patients with sub-optimal prognosis or with medium- or inferior-quality embryos, the selection between SET and DET could be perplexing."}, {"Authors": "A. Goyal, M. Kuchana and KPR. Ayyagari, ", "Title": "\"Machine learning predicts live-birth occurrence before in-vitro fertilization treatment.\", ", "Journal": "Scientific reports ", "Volume": "10(1) ", "Date": "Dec. 2020", "PubmedID": "PUBMED: 33262383; ", "DOI": "DOI 10.1038/s41598-020-76928-z.", "Abstract": "In-vitro fertilization (IVF) is a popular method of resolving complications such as endometriosis, poor egg quality, a genetic disease of mother or father, problems with ovulation, antibody problems that harm sperm or eggs, the inability of sperm to penetrate or survive in the cervical mucus and low sperm counts, resulting human infertility. Nevertheless, IVF does not guarantee success in the fertilization. Choosing IVF is burdensome for the reason of high cost and uncertainty in the result. As the complications and fertilization factors are numerous in the IVF process, it is a cumbersome task for fertility doctors to give an accurate prediction of a successful birth. Artificial Intelligence (AI) has been employed in this study for predicting the live-birth occurrence. This work mainly focuses on making predictions of live-birth occurrence when an embryo forms from a couple and not a donor. Here, we compare various AI algorithms, including both classical Machine Learning, deep learning architecture, and an ensemble of algorithms on the publicly available dataset provided by Human Fertilisation and Embryology Authority (HFEA). Insights on data and metrics such as confusion matrices, F1-score, precision, recall, receiver operating characteristic (ROC) curves are demonstrated in the subsequent sections. The training process has two settings Without feature selection and With feature selection to train classifier models. Machine Learning, Deep learning, ensemble models classification paradigms have been trained in both settings. The Random Forest model achieves the highest F1-score of 76.49% in without feature selection setting. For the same model, the precision, recall, and area under the ROC Curve (ROC AUC) scores are 77%, 76%, and 84.60%, respectively. The success of the pregnancy depends on both male and female traits and living conditions. This study predicts a successful pregnancy through the clinically relevant parameters in In-vitro fertilization. Thus artificial intelligence plays a promising role in decision making process to support the diagnosis, prognosis, treatment etc."}, {"Authors": "CM. Louis, A. Erwin, N. Handayani, AA. Polim, A. Boediono and I. Sini, ", "Title": "\"Review of computer vision application in in vitro fertilization: the application of deep learning-based computer vision technology in the world of IVF.\", ", "Journal": "Journal of assisted reproduction and genetics ", "Volume": "38(7) ", "Date": "Jul. 2021", "PubmedID": "PUBMED: 33811587; ", "DOI": "DOI 10.1007/s10815-021-02123-2.", "Abstract": "In vitro fertilization has been regarded as a forefront solution in treating infertility for over four decades, yet its effectiveness has remained relatively low. This could be attributed to the lack of advancements for the method of observing and selecting the most viable embryos for implantation. The conventional morphological assessment of embryos exhibits inevitable drawbacks which include time- and effort-consuming, and imminent risks of bias associated with subjective assessments performed by individual embryologists. A combination of these disadvantages, undeterred by the introduction of the time-lapse incubator technology, has been considered as a prominent contributor to the less preferable success rate of IVF cycles. Nonetheless, a recent surge of AI-based solutions for tasks automation in IVF has been observed. An AI-powered assistant could improve the efficiency of performing certain tasks in addition to offering accurate algorithms that behave as baselines to minimize the subjectivity of the decision-making process. Through a comprehensive review, we have discovered multiple approaches of implementing deep learning technology, each with varying degrees of success, for constructing the automated systems in IVF which could evaluate and even annotate the developmental stages of an embryo."}, {"Authors": "SJ. Gunderson, LC. Puga Molina, N. Spies, PA. Balestrini, MG. Buffone, ES. Jungheim, J. Riley and CM. Santi, ", "Title": "\"Machine-learning algorithm incorporating capacitated sperm intracellular pH predicts conventional in vitro fertilization success in normospermic patients.\", ", "Journal": "Fertility and sterility ", "Volume": "115(4) ", "Date": "Apr. 2021", "PubmedID": "PUBMED: 33461755; ", "DOI": "DOI 10.1016/j.fertnstert.2020.10.038.", "Abstract": "To measure human sperm intracellular pH (pHi) and develop a machine-learning algorithm to predict successful conventional in vitro fertilization (IVF) in normospermic patients."}, {"Authors": "M. Simopoulou, K. Sfakianoudis, E. Maziotis, N. Antoniou, A. Rapani, G. Anifandis, P. Bakas, S. Bolaris, A. Pantou, K. Pantos and M. Koutsilieris, ", "Title": "\"Are computational applications the \"crystal ball\" in the IVF laboratory? The evolution from mathematics to artificial intelligence.\", ", "Journal": "Journal of assisted reproduction and genetics ", "Volume": "35(9) ", "Date": "Sep. 2018", "PubmedID": "PUBMED: 30054845; ", "DOI": "DOI 10.1007/s10815-018-1266-6.", "Abstract": "Mathematics rules the world of science. Innovative technologies based on mathematics have paved the way for implementation of novel strategies in assisted reproduction. Ascertaining efficient embryo selection in order to secure optimal pregnancy rates remains the focus of the in vitro fertilization scientific community and the strongest driver behind innovative approaches. This scoping review aims to describe and analyze complex models based on mathematics for embryo selection, devices, and software most widely employed in the IVF laboratory and algorithms in the service of the cutting-edge technology of artificial intelligence. Despite their promising nature, the practicing embryologist is the one ultimately responsible for the success of the IVF laboratory and thus the one to approve embracing pioneering technologies in routine practice. Applied mathematics and computational biology have already provided significant insight into the selection of the most competent preimplantation embryo. This review describes the leap of evolution from basic mathematics to bioinformatics and investigates the possibility that computational applications may be the means to foretell a promising future for the IVF clinical practice."}, {"Authors": "MF. Kragh and H. Karstoft, ", "Title": "\"Embryo selection with artificial intelligence: how to evaluate and compare methods?,\" ", "Journal": "Journal of assisted reproduction and genetics ", "Volume": "38(7) ", "Date": "Jul. 2021", "PubmedID": "PUBMED: 34173914; ", "DOI": "DOI 10.1007/s10815-021-02254-6.", "Abstract": "Embryo selection within in vitro fertilization (IVF) is the process of evaluating qualities of fertilized oocytes (embryos) and selecting the best embryo(s) available within a patient cohort for subsequent transfer or cryopreservation. In recent years, artificial intelligence (AI) has been used extensively to improve and automate the embryo ranking and selection procedure by extracting relevant information from embryo microscopy images. The AI models are evaluated based on their ability to identify the embryo(s) with the highest chance(s) of achieving a successful pregnancy. Whether such evaluations should be based on ranking performance or pregnancy prediction, however, seems to divide studies. As such, a variety of performance metrics are reported, and comparisons between studies are often made on different outcomes and data foundations. Moreover, superiority of AI methods over manual human evaluation is often claimed based on retrospective data, without any mentions of potential bias. In this paper, we provide a technical view on some of the major topics that divide how current AI models are trained, evaluated and compared. We explain and discuss the most common evaluation metrics and relate them to the two separate evaluation objectives, ranking and prediction. We also discuss when and how to compare AI models across studies and explain in detail how a selection bias is inevitable when comparing AI models against current embryo selection practice in retrospective cohort studies."}, {"Authors": "L. Liu, Y. Jiao, X. Li, Y. Ouyang and D. Shi, ", "Title": "\"Machine learning algorithms to predict early pregnancy loss after in vitro fertilization-embryo transfer with fetal heart rate as a strong predictor.\", ", "Journal": "Computer methods and programs in biomedicine ", "Volume": "196 ", "Date": "Nov. 2020", "PubmedID": "PUBMED: 32623348; ", "DOI": "DOI 10.1016/j.cmpb.2020.105624.", "Abstract": "According to previous studies, after in vitro fertilization-embryo transfer (IVF-ET) there exist a high early pregnancy loss (EPL) rate. The objectives of this study were to construct a prediction model of embryonic development by using machine learning algorithms based on historical case data, in this way doctors can make more accurate suggestions on the number of patient follow-ups, and provide decision support for doctors who are relatively inexperienced in clinical practice."}, {"Authors": "N. Noor, CP. Vignarajan, N. Malhotra and P. Vanamail, ", "Title": "\"Three-Dimensional Automated Volume Calculation (Sonography-Based Automated Volume Count) versus Two-Dimensional Manual Ultrasonography for Follicular Tracking and Oocyte Retrieval in Women Undergoing in vitro Fertilization-Embryo Transfer: A Randomized Controlled Trial.\", ", "Journal": "Journal of human reproductive sciences ", "Volume": "13(4) ", "Date": "", "PubmedID": "PUBMED: 33627979; ", "DOI": "DOI 10.4103/jhrs.JHRS_91_20.", "Abstract": "To compare the oocyte yield using three-dimensional (3D) automated and two-dimensional (2D) ultrasound-based follicle tracking in women undergoing in vitro fertilization-embryo transfer (IVF-ET)."}, {"Authors": "L. Zhao, X. Zheng, J. Liu, R. Zheng, R. Yang, Y. Wang and L. Sun, ", "Title": "\"PPAR signaling pathway in the first trimester placenta from in vitro fertilization and embryo transfer.\", ", "Journal": "Biomedicine & pharmacotherapy = Biomedecine & pharmacotherapie ", "Volume": "118 ", "Date": "Oct. 2019", "PubmedID": "PUBMED: 31351426; ", "DOI": "DOI 10.1016/j.biopha.2019.109251.", "Abstract": "Placenta is a temporary critical organ related to fetal development and pregnancy outcomes. And epidemiologic data demonstrate an increased risk of placental abnormality after in vitro fertilization and embryo transfer (IVF-ET). This study aims to explore the molecular mechanism for PPAR signaling pathway in placenta subjected to IVF-ET in the first trimester. Four first trimester placenta samples from double chorionic twins to single reduction in IVF-ET only because of oviducts factors. The other four control placenta samples from double chorionic twin were derived from those unplanned spontaneously conceived pregnancy after the legal termination. Affymetrix HG-U133 Plus 2.0 Array was performed to evaluate the global gene expressions. We confirmed microarray results from 10 significant differential genes using RT-qPCR. And 10 deregulated gene products were stained in the first trimester placenta by immunohistochemistry. These differentially expressed genes in IVF-ET placentas were submitted to functional annotation of clustering tools of bioinformatics resources and gene ontology enrichment analysis. Schematic representation of placental PPAR signaling pathway was labelled by Kyoto Encyclopedia of Genes and Genomes (KEGG). Analysis results of early placental PPAR signaling pathway gene expression from 8 women demonstrated 34 genes with a significant change in expression between IVF-ET and control group, 25 up-regulated; 9 down-regulated. KEGG pathway analysis indicated that IVF-ET manipulation extensively over-activated PPAR signaling pathway. Immune tolerance, trophoblast invasion, syncytia formation, lipid and glucose metabolism, inflammatory response and other complex biological functions were disturbed. RT-qPCR results and proteins staining intensity were consisted with microarray. Placental gene expressions and functions in PPAR signaling pathway were affected by IVF-ET treatment in the first trimester, which may offer a potential mechanism for the pathogenesis of various adverse outcomes during the perinatal period."}, {"Authors": "CFL. Hickman, H. Alshubbar, J. Chambost, C. Jacques, CA. Pena, A. Drakeley and T. Freour, ", "Title": "\"Data sharing: using blockchain and decentralized data technologies to unlock the potential of artificial intelligence: What can assisted reproduction learn from other areas of medicine?,\" ", "Journal": "Fertility and sterility ", "Volume": "114(5) ", "Date": "Nov. 2020", "PubmedID": "PUBMED: 33160515; ", "DOI": "DOI 10.1016/j.fertnstert.2020.09.160.", "Abstract": "The extension of blockchain use for nonfinancial domains has revealed opportunities to the health care sector that answer the need for efficient and effective data and information exchanges in a secure and transparent manner. Blockchain is relatively novel in health care and particularly for data analytics, although there are examples of improvements achieved. We provide a systematic review of blockchain uses within the health care industry, with a particular focus on the in vitro fertilization (IVF) field. Blockchain technology in the fertility sector, including data sharing collaborations compliant with ethical data handling within confines of international law, allows for large-scale prospective cohort studies to proceed at an international scale. Other opportunities include gamete donation and matching, consent sharing, and shared resources between different clinics."}, {"Authors": "CL. Curchoe, J. Malmsten, C. Bormann, H. Shafiee, A. Flores-Saiffe Farias, G. Mendizabal, A. Chavez-Badiola, A. Sigaras, H. Alshubbar, J. Chambost, C. Jacques, CA. Pena, A. Drakeley, T. Freour, I. Hajirasouliha, CFL. Hickman, O. Elemento, N. Zaninovic and Z. Rosenwaks, ", "Title": "\"Predictive modeling in reproductive medicine: Where will the future of artificial intelligence research take us?,\" ", "Journal": "Fertility and sterility ", "Volume": "114(5) ", "Date": "Nov. 2020", "PubmedID": "PUBMED: 33160516; ", "DOI": "DOI 10.1016/j.fertnstert.2020.10.040.", "Abstract": "Artificial intelligence (AI) systems have been proposed for reproductive medicine since 1997. Although AI is the main driver of emergent technologies in reproduction, such as robotics, Big Data, and internet of things, it will continue to be the engine for technological innovation for the foreseeable future. What does the future of AI research look like?"}, {"Authors": "HL. Khan, S. Bhatti, S. Abbas, C. Kaloglu, AM. Isa, H. Younas, R. Ziders, YL. Khan, Z. Hassan, BO. Turhan, A. Yildiz, HH. Aydin and EY. Kalyan, ", "Title": "\"Extracellular microRNAs: key players to explore the outcomes of in vitro fertilization.\", ", "Journal": "Reproductive biology and endocrinology : RB&E ", "Volume": "19(1) ", "Date": "May. 2021", "PubmedID": "PUBMED: 33992122; ", "DOI": "DOI 10.1186/s12958-021-00754-9.", "Abstract": "MicroRNAs (miRNAs) are small RNA molecules that modulate post-transcriptional gene regulation. They are often used as promising non-invasive biomarkers for the early diagnosis of cancer. However, their roles in assisted reproduction are still unknown."}, {"Authors": "M. Zhao, M. Xu, H. Li, O. Alqawasmeh, JPW. Chung, TC. Li, TL. Lee, PM. Tang and DYL. Chan, ", "Title": "\"Application of convolutional neural network on early human embryo segmentation during in vitro fertilization.\", ", "Journal": "Journal of cellular and molecular medicine ", "Volume": "25(5) ", "Date": "Mar. 2021", "PubmedID": "PUBMED: 33486848; ", "DOI": "DOI 10.1111/jcmm.16288.", "Abstract": "Selection of the best quality embryo is the key for a faithful implantation in in vitro fertilization (IVF) practice. However, the process of evaluating numerous images captured by time-lapse imaging (TLI) system is time-consuming and some important features cannot be recognized by naked eyes. Convolutional neural network (CNN) is used in medical imaging yet in IVF. The study aims to apply CNN on day-one human embryo TLI. We first presented CNN algorithm for day-one human embryo segmentation on three distinct features: zona pellucida (ZP), cytoplasm and pronucleus (PN). We tested the CNN performance compared side-by-side with manual labelling by clinical embryologist, then measured the segmented day-one human embryo parameters and compared them with literature reported values. The precisions of segmentation were that cytoplasm over 97%, PN over 84% and ZP around 80%. For the morphometrics data of cytoplasm, ZP and PN, the results were comparable with those reported in literatures, which showed high reproducibility and consistency. The CNN system provides fast and stable analytical outcome to improve work efficiency in IVF setting. To conclude, our CNN system is potential to be applied in practice for day-one human embryo segmentation as a robust tool with high precision, reproducibility and speed."}, {"Authors": "E. Hariton, EA. Chi, G. Chi, JR. Morris, J. Braatz, P. Rajpurkar and M. Rosen, ", "Title": "\"A machine learning algorithm can optimize the day of trigger to improve in vitro fertilization outcomes.\", ", "Journal": "Fertility and sterility ", "Volume": "116(5) ", "Date": "Nov. 2021", "PubmedID": "PUBMED: 34256948; ", "DOI": "DOI 10.1016/j.fertnstert.2021.06.018.", "Abstract": "To determine whether a machine learning causal inference model can optimize trigger injection timing to maximize the yield of fertilized oocytes (2PNs) and total usable blastocysts for a given cohort of stimulated follicles."}, {"Authors": "EI. Fernandez, AS. Ferreira, MHM. Cecílio, DS. Chéles, RCM. de Souza, MFG. Nogueira and JC. Rocha, ", "Title": "\"Artificial intelligence in the IVF laboratory: overview through the application of different types of algorithms for the classification of reproductive data.\", ", "Journal": "Journal of assisted reproduction and genetics ", "Volume": "37(10) ", "Date": "Oct. 2020", "PubmedID": "PUBMED: 32654105; ", "DOI": "DOI 10.1007/s10815-020-01881-9.", "Abstract": "Over the past years, the assisted reproductive technologies (ARTs) have been accompanied by constant innovations. For instance, intracytoplasmic sperm injection (ICSI), time-lapse monitoring of the embryonic morphokinetics, and PGS are innovative techniques that increased the success of the ART. In the same trend, the use of artificial intelligence (AI) techniques is being intensively researched whether in the embryo or spermatozoa selection. Despite several studies already published, the use of AI within assisted reproduction clinics is not yet a reality. This is largely due to the different AI techniques that are being proposed to be used in the daily routine of the clinics, which causes some uncertainty in their use. To shed light on this complex scenario, this review briefly describes some of the most frequently used AI algorithms, their functionalities, and their potential use. Several databases were analyzed in search of articles where applied artificial intelligence algorithms were used on reproductive data. Our focus was on the classification of embryonic cells and semen samples. Of a total of 124 articles analyzed, 32 were selected for this review. From the proposed algorithms, most have achieved a satisfactory precision, demonstrating the potential of a wide range of AI techniques. However, the evaluation of these studies suggests the need for more standardized research to validate the proposed models and their algorithms. Routine use of AI in assisted reproduction clinics is just a matter of time. However, the choice of AI technique to be used is supported by a better understanding of the principles subjacent to each technique, that is, its robustness, pros, and cons. We provide some current (although incipient) and potential uses of AI on the clinic routine, discussing how accurate and friendly it could be. Finally, we propose some standards for AI research on the selection of the embryo to be transferred and other future hints. For us, the imminence of its use is evident, providing a revolutionary milestone that will impact the ART."}, {"Authors": "C. Siristatidis, P. Vogiatzi, A. Pouliakis, M. Trivella, N. Papantoniou and S. Bettocchi, ", "Title": "\"Predicting IVF Outcome: A Proposed Web-based System Using Artificial Intelligence.\", ", "Journal": "In vivo (Athens, Greece) ", "Volume": "30(4) ", "Date": "", "PubmedID": "PUBMED: 27381616; ", "DOI": "", "Abstract": "To propose a functional in vitro fertilization (IVF) prediction model to assist clinicians in tailoring personalized treatment of subfertile couples and improve assisted reproduction outcome."}, {"Authors": "G. Letterie, ", "Title": "\"Three ways of knowing: the integration of clinical expertise, evidence-based medicine, and artificial intelligence in assisted reproductive technologies.\", ", "Journal": "Journal of assisted reproduction and genetics ", "Volume": "38(7) ", "Date": "Jul. 2021", "PubmedID": "PUBMED: 33870475; ", "DOI": "DOI 10.1007/s10815-021-02159-4.", "Abstract": "Decision-making in fertility care is on the cusp of a significant frameshift. Online tools to integrate artificial intelligence into the decision-making process across all aspects of ART are rapidly emerging. These tools have the potential to improve outcomes and transition decision-making from one based on traditional provider centric assessments toward a hybrid triad of expertise, evidence, and algorithmic data analytics using AI. We can look forward to a time when AI will be the third part of a provider's tool box to complement expertise and medical literature to enable ever more accurate predictions and outcomes in ART. In their fully integrated format, these tools will be part of a digital fertility ecosystem of analytics embedded within an EMR. To date, the impact of AI on ART outcomes is inconclusive. No prospective studies have shown clear cut benefit or cost reductions over current practices, but we are very early in the process of developing and evaluating these tools. We owe it to ourselves to begin to examine these AI-driven analytics and develop a very clear idea about where we can and should go before we roll these tools into clinical care. Thoughtful scrutiny is essential lest we find ourselves in a position of trying to modulate and modify after entry of these tools into our clinics and patient care. The purpose of this commentary is to highlight the evolution and impact AI has had in other fields relevant to the fertility sector and describe a vision for applications within ART that could improve outcomes, reduce costs, and positively impact clinical care."}, {"Authors": "J. Qiu, P. Li, M. Dong, X. Xin and J. Tan, ", "Title": "\"Personalized prediction of live birth prior to the first in vitro fertilization treatment: a machine learning method.\", ", "Journal": "Journal of translational medicine ", "Volume": "17(1) ", "Date": "Sep. 2019", "PubmedID": "PUBMED: 31547822; ", "DOI": "DOI 10.1186/s12967-019-2062-5.", "Abstract": "Infertility has become a global health issue with the number of couples seeking in vitro fertilization (IVF) worldwide continuing to rise. Some couples remain childless after several IVF cycles. Women undergoing IVF face greater risks and financial burden. A prediction model to predict the live birth chance prior to the first IVF treatment is needed in clinical practice for patients counselling and shaping expectations."}, {"Authors": "J. Cheng, X. Jin, J. Shen, Y. Mu, Q. Li, L. Xia, Y. Gao and Y. Xia, ", "Title": "\"Whole Transcriptome Sequencing Reveals How Acupuncture and Moxibustion Increase Pregnancy Rate in Patients Undergoing In Vitro Fertilization-Embryo Transplantation.\", ", "Journal": "BioMed research international ", "Volume": "2019 ", "Date": "2019", "PubmedID": "PUBMED: 31275970; ", "DOI": "DOI 10.1155/2019/4179617.", "Abstract": "In vitro fertilization and embryo transfer (IVF-ET) technology has been widely used in the therapy of refractory infertility. Previous studies showed that acupuncture can effectively increase the clinical pregnancy rate of IVF-ET. However, the molecular mechanism is unknown."}, {"Authors": "MP. Trolice, C. Curchoe and AM. Quaas, ", "Title": "\"Artificial intelligence-the future is now.\", ", "Journal": "Journal of assisted reproduction and genetics ", "Volume": "38(7) ", "Date": "Jul. 2021", "PubmedID": "PUBMED: 34231110; ", "DOI": "DOI 10.1007/s10815-021-02272-4.", "Abstract": "The pros and cons of artificial intelligence in assisted reproductive technology are presented."}, {"Authors": "C. Blank, RR. Wildeboer, I. DeCroo, K. Tilleman, B. Weyers, P. de Sutter, M. Mischi and BC. Schoot, ", "Title": "\"Prediction of implantation after blastocyst transfer in in vitro fertilization: a machine-learning perspective.\", ", "Journal": "Fertility and sterility ", "Volume": "111(2) ", "Date": "Feb. 2019", "PubmedID": "PUBMED: 30611557; ", "DOI": "DOI 10.1016/j.fertnstert.2018.10.030.", "Abstract": "To develop a random forest model (RFM) to predict implantation potential of a transferred embryo and compare it with a multivariate logistic regression model (MvLRM), based on data from a large cohort including in vitro fertilization (IVF) patients treated with the use of single-embryo transfer (SET) of blastocyst-stage embryos."}, {"Authors": "JW. Oh, SK. Kim, KC. Cho, MS. Kim, CS. Suh, JR. Lee and KP. Kim, ", "Title": "\"Proteomic analysis of human follicular fluid in poor ovarian responders during in vitro fertilization.\", ", "Journal": "Proteomics ", "Volume": "17(6) ", "Date": "Mar. 2017", "PubmedID": "PUBMED: 28130869; ", "DOI": "DOI 10.1002/pmic.201600333.", "Abstract": "Poor ovarian response (POR) in controlled ovarian stimulation is often observed during in vitro fertilization and embryo transfer cycles and it is a major problem. A POR has been found to be related to several factors, including advanced age, high body mass index, and history of ovarian or pelvic surgery. However, it is difficult to predict POR, as there are no specific biomarkers known. In this study, we used quantitative proteomic analyses to investigate potential biomarkers that can predict poor response during in vitro fertilization based on follicular fluid samples. A total of 1079 proteins were identified using a high-resolution orbitrap mass spectrometer coupled online to a nanoflow-LC system. It is notable that 65 upregulated and 66 downregulated proteins were found to be functionally enriched in poor responders. We also validated these differentially expressed proteins using a triple-quadrupole mass spectrometer for quantification of targeted proteins. Of the differentially expressed proteins, three proteins (pregnancy zone protein, renin, and sushi repeat-containing protein SRPX) were regarded as statistically significant (p < 0.05)."}, {"Authors": "M. VerMilyea, JMM. Hall, SM. Diakiw, A. Johnston, T. Nguyen, D. Perugini, A. Miller, A. Picou, AP. Murphy and M. Perugini, ", "Title": "\"Development of an artificial intelligence-based assessment model for prediction of embryo viability using static images captured by optical light microscopy during IVF.\", ", "Journal": "Human reproduction (Oxford, England) ", "Volume": "35(4) ", "Date": "Apr. 2020", "PubmedID": "PUBMED: 32240301; ", "DOI": "DOI 10.1093/humrep/deaa013.", "Abstract": "Can an artificial intelligence (AI)-based model predict human embryo viability using images captured by optical light microscopy?"}, {"Authors": "A. Uyar, A. Bener and HN. Ciray, ", "Title": "\"Predictive Modeling of Implantation Outcome in an In Vitro Fertilization Setting: An Application of Machine Learning Methods.\", ", "Journal": "Medical decision making : an international journal of the Society for Medical Decision Making ", "Volume": "35(6) ", "Date": "Aug. 2015", "PubmedID": "PUBMED: 24842951; ", "DOI": "DOI 10.1177/0272989X14535984.", "Abstract": "Multiple embryo transfers in in vitro fertilization (IVF) treatment increase the number of successful pregnancies while elevating the risk of multiple gestations. IVF-associated multiple pregnancies exhibit significant financial, social, and medical implications. Clinicians need to decide the number of embryos to be transferred considering the tradeoff between successful outcomes and multiple pregnancies."}, {"Authors": "CL. Curchoe and CL. Bormann, ", "Title": "\"Artificial intelligence and machine learning for human reproduction and embryology presented at ASRM and ESHRE 2018.\", ", "Journal": "Journal of assisted reproduction and genetics ", "Volume": "36(4) ", "Date": "Apr. 2019", "PubmedID": "PUBMED: 30690654; ", "DOI": "DOI 10.1007/s10815-019-01408-x.", "Abstract": "Sixteen artificial intelligence (AI) and machine learning (ML) approaches were reported at the 2018 annual congresses of the American Society for Reproductive Biology (9) and European Society for Human Reproduction and Embryology (7). Nearly every aspect of patient care was investigated, including sperm morphology, sperm identification, identification of empty or oocyte containing follicles, predicting embryo cell stages, predicting blastocyst formation from oocytes, assessing human blastocyst quality, predicting live birth from blastocysts, improving embryo selection, and for developing optimal IVF stimulation protocols. This represents a substantial increase in reports over 2017, where just one abstract each was reported at ASRM (AI) and ESHRE (ML). Our analysis reveals wide variability in how AI and ML methods are described (from not at all or very generic to fully describing the architectural framework) and large variability on accepted dataset sizes (from just 3 patients with 16 follicles in the smallest dataset to 661,060 images of 11,898 human embryos in one of the largest). AI and ML are clearly burgeoning methodologies in human reproduction and embryology and would benefit from early application of reporting standards."}, {"Authors": "A. Chavez-Badiola, A. Flores-Saiffe-Farías, G. Mendizabal-Ruiz, AJ. Drakeley and J. Cohen, ", "Title": "\"Embryo Ranking Intelligent Classification Algorithm (ERICA): artificial intelligence clinical assistant predicting embryo ploidy and implantation.\", ", "Journal": "Reproductive biomedicine online ", "Volume": "41(4) ", "Date": "Oct. 2020", "PubmedID": "PUBMED: 32843306; ", "DOI": "DOI 10.1016/j.rbmo.2020.07.003.", "Abstract": "Can a deep machine learning artificial intelligence algorithm predict ploidy and implantation in a known data set of static blastocyst images, and how does its performance compare against chance and experienced embryologists?"}, {"Authors": "L. Bori, E. Paya, L. Alegre, TA. Viloria, JA. Remohi, V. Naranjo and M. Meseguer, ", "Title": "\"Novel and conventional embryo parameters as input data for artificial neural networks: an artificial intelligence model applied for prediction of the implantation potential.\", ", "Journal": "Fertility and sterility ", "Volume": "114(6) ", "Date": "Dec. 2020", "PubmedID": "PUBMED: 32917380; ", "DOI": "DOI 10.1016/j.fertnstert.2020.08.023.", "Abstract": "To describe novel embryo features capable of predicting implantation potential as input data for an artificial neural network (ANN) model."}, {"Authors": "P. Khosravi, E. Kazemi, Q. Zhan, JE. Malmsten, M. Toschi, P. Zisimopoulos, A. Sigaras, S. Lavery, LAD. Cooper, C. Hickman, M. Meseguer, Z. Rosenwaks, O. Elemento, N. Zaninovic and I. Hajirasouliha, ", "Title": "\"Deep learning enables robust assessment and selection of human blastocysts after in vitro fertilization.\", ", "Journal": "NPJ digital medicine ", "Volume": "2 ", "Date": "2019", "PubmedID": "PUBMED: 31304368; ", "DOI": "DOI 10.1038/s41746-019-0096-y.", "Abstract": "Visual morphology assessment is routinely used for evaluating of embryo quality and selecting human blastocysts for transfer after in vitro fertilization (IVF). However, the assessment produces different results between embryologists and as a result, the success rate of IVF remains low. To overcome uncertainties in embryo quality, multiple embryos are often implanted resulting in undesired multiple pregnancies and complications. Unlike in other imaging fields, human embryology and IVF have not yet leveraged artificial intelligence (AI) for unbiased, automated embryo assessment. We postulated that an AI approach trained on thousands of embryos can reliably predict embryo quality without human intervention. We implemented an AI approach based on deep neural networks (DNNs) to select highest quality embryos using a large collection of human embryo time-lapse images (about 50,000 images) from a high-volume fertility center in the United States. We developed a framework (STORK) based on Google's Inception model. STORK predicts blastocyst quality with an AUC of >0.98 and generalizes well to images from other clinics outside the US and outperforms individual embryologists. Using clinical data for 2182 embryos, we created a decision tree to integrate embryo quality and patient age to identify scenarios associated with pregnancy likelihood. Our analysis shows that the chance of pregnancy based on individual embryos varies from 13.8% (age ≥41 and poor-quality) to 66.3% (age <37 and good-quality) depending on automated blastocyst quality assessment and patient age. In conclusion, our AI-driven approach provides a reproducible way to assess embryo quality and uncovers new, potentially personalized strategies to select embryos."}, {"Authors": "E. Babayev and EC. Feinberg, ", "Title": "\"Embryo through the lens: from time-lapse cinematography to artificial intelligence.\", ", "Journal": "Fertility and sterility ", "Volume": "113(2) ", "Date": "Feb. 2020", "PubmedID": "PUBMED: 32106987; ", "DOI": "DOI 10.1016/j.fertnstert.2019.12.001.", "Abstract": "\"Once a new technology rolls over you, if you're not part of the steamroller, you're part of the road.\" -Stewart Brand."}, {"Authors": "J. Geller, I. Collazo, R. Pai, N. Hendon, SD. Lokeshwar, H. Arora, M. Molina and R. Ramasamy, ", "Title": "\"An Artificial Intelligence-Based Algorithm for Predicting Pregnancy Success Using Static Images Captured by Optical Light Microscopy during Intracytoplasmic Sperm Injection.\", ", "Journal": "Journal of human reproductive sciences ", "Volume": "14(3) ", "Date": "", "PubmedID": "PUBMED: 34759619; ", "DOI": "DOI 10.4103/jhrs.jhrs_53_21.", "Abstract": "Analysis of embryos for in vitro fertilization (IVF) involves manual grading of human embryos through light microscopy. Recent research shows that artificial intelligence techniques applied to time lapse embryo images can successfully ascertain embryo quality. However, laboratories often capture static images and cannot apply this research in a real-world setting. Further, current models do not predict the outcome of pregnancy."}, {"Authors": "KJ. Doody, ", "Title": "\"Infertility Treatment Now and in the Future.\", ", "Journal": "Obstetrics and gynecology clinics of North America ", "Volume": "48(4) ", "Date": "Dec. 2021", "PubmedID": "PUBMED: 34756298; ", "DOI": "DOI 10.1016/j.ogc.2021.07.005.", "Abstract": "Treatment of infertility has evolved as understanding of reproduction has improved. Fertility promoting surgery still is performed and recent advances have broken new ground. Hormonal treatments to correct gonadal dysfunction have been developed, but multiple gestation continues to be a significant complication. Assisted reproductive technologies have improved such that in vitro fertilization and its variants increasingly are used to treat nearly all causes of infertility. Advances in assisted reproduction are of 2 types: (1) incremental optimization of existing techniques and (2) development of new, disruptive technologies. Artificial intelligence and stem cell technologies are poised to have impact in the near future."}, {"Authors": "Z. Chen, Z. Wang, M. Du and Z. Liu, ", "Title": "\"Artificial Intelligence in the Assessment of Female Reproductive Function Using Ultrasound: A Review.\", ", "Journal": "Journal of ultrasound in medicine : official journal of the American Institute of Ultrasound in Medicine ", "Volume": "", "Date": "Sep. 2021", "PubmedID": "PUBMED: 34524706; ", "DOI": "DOI 10.1002/jum.15827.", "Abstract": "The incidence of infertility is continuously increasing nearly all over the world in recent years, and novel methods for accurate assessment are of great need. Artificial Intelligence (AI) has gradually become an effective supplementary method for the assessment of female reproductive function. It has been used in clinical follicular monitoring, optimum timing for transplantation, and prediction of pregnancy outcome. Some literatures summarize the use of AI in this field, but few of them focus on the assessment of female reproductive function by AI-aided ultrasound. In this review, we mainly discussed the applicability, feasibility, and value of clinical application of AI in ultrasound to monitor follicles, assess endometrial receptivity, and predict the pregnancy outcome of in vitro fertilization and embryo transfer (IVF-ET). The limitations, challenges, and future trends of ultrasound combined with AI in providing efficient and individualized evaluation of female reproductive function had also been mentioned."}, {"Authors": "P. Iftikhar, MV. Kuijpers, A. Khayyat, A. Iftikhar and M. DeGouvia De Sa, ", "Title": "\"Artificial Intelligence: A New Paradigm in Obstetrics and Gynecology Research and Clinical Practice.\", ", "Journal": "Cureus ", "Volume": "12(2) ", "Date": "Feb. 2020", "PubmedID": "PUBMED: 32257670; ", "DOI": "DOI 10.7759/cureus.7124.", "Abstract": "Artificial intelligence (AI) is growing exponentially in various fields, including medicine. This paper reviews the pertinent aspects of AI in obstetrics and gynecology (OB/GYN) and how these can be applied to improve patient outcomes and reduce the healthcare costs and workload for clinicians. Herein, we will address current AI uses in OB/GYN, and the use of AI as a tool to interpret fetal heart rate (FHR) and cardiotocography (CTG) to aid in the detection of preterm labor, pregnancy complications, and review discrepancies in its interpretation between clinicians to reduce maternal and infant morbidity and mortality. AI systems can be used as tools to create algorithms identifying asymptomatic women with short cervical length who are at risk of preterm birth. Additionally, the benefits of using the vast data capacity of AI storage can assist in determining the risk factors for preterm labor using multiomics and extensive genomic data. In the field of gynecological surgery, the use of augmented reality helps surgeons detect vital structures, thus decreasing complications, reducing operative time, and helping surgeons in training to practice in a realistic setting. Using three-dimensional (3D) printers can provide materials that mimic real tissues and also helps trainees to practice on a realistic model. Furthermore, 3D imaging allows better depth perception than its two-dimensional (2D) counterpart, allowing the surgeon to create preoperative plans according to tissue depth and dimensions. Although AI has some limitations, this new technology can improve the prognosis and management of patients, reduce healthcare costs, and help OB/GYN practitioners to reduce their workload and increase their efficiency and accuracy by incorporating AI systems into their daily practice. AI has the potential to guide practitioners in decision-making, reaching a diagnosis, and improving case management. It can reduce healthcare costs by decreasing medical errors and providing more dependable predictions. AI systems can accurately provide information on the large array of patients in clinical settings, although more robust data is required."}, {"Authors": "C. Manna, L. Nanni, A. Lumini and S. Pappalardo, ", "Title": "\"Artificial intelligence techniques for embryo and oocyte classification.\", ", "Journal": "Reproductive biomedicine online ", "Volume": "26(1) ", "Date": "Jan. 2013", "PubmedID": "PUBMED: 23177416; ", "DOI": "DOI 10.1016/j.rbmo.2012.09.015.", "Abstract": "One of the most relevant aspects in assisted reproduction technology is the possibility of characterizing and identifying the most viable oocytes or embryos. In most cases, embryologists select them by visual examination and their evaluation is totally subjective. Recently, due to the rapid growth in the capacity to extract texture descriptors from a given image, a growing interest has been shown in the use of artificial intelligence methods for embryo or oocyte scoring/selection in IVF programmes. This work concentrates the efforts on the possible prediction of the quality of embryos and oocytes in order to improve the performance of assisted reproduction technology, starting from their images. The artificial intelligence system proposed in this work is based on a set of Levenberg-Marquardt neural networks trained using textural descriptors (the local binary patterns). The proposed system was tested on two data sets of 269 oocytes and 269 corresponding embryos from 104 women and compared with other machine learning methods already proposed in the past for similar classification problems. Although the results are only preliminary, they show an interesting classification performance. This technique may be of particular interest in those countries where legislation restricts embryo selection. One of the most relevant aspects in assisted reproduction technology is the possibility of characterizing and identifying the most viable oocytes or embryos. In most cases, embryologists select them by visual examination and their evaluation is totally subjective. Recently, due to the rapid growth in our capacity to extract texture descriptors from a given image, a growing interest has been shown in the use of artificial intelligence methods for embryo or oocyte scoring/selection in IVF programmes. In this work, we concentrate our efforts on the possible prediction of the quality of embryos and oocytes in order to improve the performance of assisted reproduction technology, starting from their images. The artificial intelligence system proposed in this work is based on a set of Levenberg-Marquardt neural networks trained using textural descriptors (the 'local binary patterns'). The proposed system is tested on two data sets, of 269 oocytes and 269 corresponding embryos from 104 women, and compared with other machine learning methods already proposed in the past for similar classification problems. Although the results are only preliminary, they showed an interesting classification performance. This technique may be of particular interest in those countries where legislation restricts embryo selection."}, {"Authors": "M. Meseguer, U. Kruhne and S. Laursen, ", "Title": "\"Full in vitro fertilization laboratory mechanization: toward robotic assisted reproduction?,\" ", "Journal": "Fertility and sterility ", "Volume": "97(6) ", "Date": "Jun. 2012", "PubmedID": "PUBMED: 22480821; ", "DOI": "DOI 10.1016/j.fertnstert.2012.03.013.", "Abstract": "To describe the current efforts made to standardize different steps of assisted reproductive technology processes by the introduction of new technologies for the nonsubjective sperm selection process, oocyte denudation by mechanical removal of cumulus cells, oocyte positioning, sperm motility screening, fertilization, embryo culture, media replacement by microfluidics, and monitoring of embryo development by time-lapse photography, embryo secretions, and/or O(2) consumption. These technologies could be integrated in a unique and fully automated device."}, {"Authors": "B. Huang, W. Tan, Z. Li and L. Jin, ", "Title": "\"An artificial intelligence model (euploid prediction algorithm) can predict embryo ploidy status based on time-lapse data.\", ", "Journal": "Reproductive biology and endocrinology : RB&E ", "Volume": "19(1) ", "Date": "Dec. 2021", "PubmedID": "PUBMED: 34903224; ", "DOI": "DOI 10.1186/s12958-021-00864-4.", "Abstract": "For the association between time-lapse technology (TLT) and embryo ploidy status, there has not yet been fully understood. TLT has the characteristics of large amount of data and non-invasiveness. If we want to accurately predict embryo ploidy status from TLT, artificial intelligence (AI) technology is a good choice. However, the current work of AI in this field needs to be strengthened."}, {"Authors": "C. Siristatidis, A. Pouliakis, C. Chrelias and D. Kassanos, ", "Title": "\"Artificial intelligence in IVF: a need.\", ", "Journal": "Systems biology in reproductive medicine ", "Volume": "57(4) ", "Date": "Aug. 2011", "PubmedID": "PUBMED: 21375363; ", "DOI": "DOI 10.3109/19396368.2011.558607.", "Abstract": "Predicting the outcome of in-vitro fertilization (IVF) treatment is an extremely semantic issue in reproductive medicine. Discrepancies in results among reproductive centres still exist making the construction of new systems capable to foresee the desired outcome a necessity. As such, artificial neural networks (ANNs) represent a combination of a learning, self-adapting, and predicting machine. In this review hypothesis paper we summarize the past efforts of the ANNs systems to predict IVF outcomes. This will be considered together with other statistical models, such as the ensemble techniques, Classification And Regression Tree (CART) and regression analysis techniques, discriminant analysis, and case based reasoning systems. We also summarize the various inputs that have been employed as parameters in these studies to predict the IVF outcome. Finally, we report our attempt to construct a new ANN architecture based on the Learning Vector Quantizer promising good generalization: a system filled by a complete data set of our IVF unit, formulated parameters most commonly used in similar studies, trained by a network expert, and evaluated in terms of predictive power."}, {"Authors": "CL. Bormann, MK. Kanakasabapathy, P. Thirumalaraju, R. Gupta, R. Pooniwala, H. Kandula, E. Hariton, I. Souter, I. Dimitriadis, LB. Ramirez, CL. Curchoe, J. Swain, LM. Boehnlein and H. Shafiee, ", "Title": "\"Performance of a deep learning based neural network in the selection of human blastocysts for implantation.\", ", "Journal": "eLife ", "Volume": "9 ", "Date": "Sep. 2020", "PubmedID": "PUBMED: 32930094; ", "DOI": "DOI 10.7554/eLife.55301.", "Abstract": "Deep learning in in vitro fertilization is currently being evaluated in the development of assistive tools for the determination of transfer order and implantation potential using time-lapse data collected through expensive imaging hardware. Assistive tools and algorithms that can work with static images, however, can help in improving the access to care by enabling their use with images acquired from traditional microscopes that are available to virtually all fertility centers. Here, we evaluated the use of a deep convolutional neural network (CNN), trained using single timepoint images of embryos collected at 113 hr post-insemination, in embryo selection amongst 97 clinical patient cohorts (742 embryos) and observed an accuracy of 90% in choosing the highest quality embryo available. Furthermore, a CNN trained to assess an embryo's implantation potential directly using a set of 97 euploid embryos capable of implantation outperformed 15 trained embryologists (75.26% vs. 67.35%, p<0.0001) from five different fertility centers."}, {"Authors": "DS. Chéles, EAD. Molin, JC. Rocha and MFG. Nogueira, ", "Title": "\"Mining of variables from embryo morphokinetics, blastocyst's morphology and patient parameters: an approach to predict the live birth in the assisted reproduction service.\", ", "Journal": "JBRA assisted reproduction ", "Volume": "24(4) ", "Date": "Oct. 2020", "PubmedID": "PUBMED: 32293823; ", "DOI": "DOI 10.5935/1518-0557.20200014.", "Abstract": "Based on growing demand for assisted reproduction technology, improved predictive models are required to optimize in vitro fertilization/intracytoplasmatic sperm injection strategies, prioritizing single embryo transfer. There are still several obstacles to overcome for the purpose of improving assisted reproductive success, such as intra- and inter-observer subjectivity in embryonic selection, high occurrence of multiple pregnancies, maternal and neonatal complications. Here, we compare studies that used several variables that impact the success of assisted reproduction, such as blastocyst morphology and morphokinetic aspects of embryo development as well as characteristics of the patients submitted to assisted reproduction, in order to predict embryo quality, implantation or live birth. Thereby, we emphasize the proposal of an artificial intelligence-based platform for a more objective method to predict live birth."}, {"Authors": "M. Knoester, FM. Helmerhorst, JP. Vandenbroucke, LA. van der Westerlaken, FJ. Walther and S. Veen, ", "Title": "\"Cognitive development of singletons born after intracytoplasmic sperm injection compared with in vitro fertilization and natural conception.\", ", "Journal": "Fertility and sterility ", "Volume": "90(2) ", "Date": "Aug. 2008", "PubmedID": "PUBMED: 17980875; ", "DOI": "", "Abstract": "To investigate cognitive development of singletons conceived by intracytoplasmic sperm injection (ICSI) at 5-8 years of age."}, {"Authors": "ML. Pedrosa, MH. Furtado, MCF. Ferreira and MM. Carneiro, ", "Title": "\"Sperm selection in IVF: the long and winding road from bench to bedside.\", ", "Journal": "JBRA assisted reproduction ", "Volume": "24(3) ", "Date": "Jul. 2020", "PubmedID": "PUBMED: 32155013; ", "DOI": "DOI 10.5935/1518-0557.20190081.", "Abstract": "Spermatozoa wage battle to conquer fertilization but the traits needed to succeed remain elusive. The natural advantageous qualities that enable only a few selected sperm cells to reach the site of fertilization remain unknown. Although in vitro fertilization (IVF) facilitates the job of spermatozoa, a universally acceptable means of sperm selection is yet to be developed. No objective or reliable sperm quality indicators have been established and sperm selection is, to a great extent, based on subjective qualitative evaluation. The best method for sperm selection in IVF presents several challenges: intrinsic sperm qualities cannot be evaluated and the ideal endpoint for these studies is debatable. An ideal method for sperm selection in ART should be noninvasive and cost-effective, and allow the identification of high-quality spermatozoa and yield better outcomes in terms of pregnancy and live birth rates. This narrative review included 85 papers and focused on the new available methods and technologies that might shed some light on sperm selection in IVF. It discusses the available data on microfluidic devices, omics profiling, micronuclei studies, sperm plasma membrane markers, and other techniques, such as Magnetic Activated Cell Sorting (MACS), Raman micro-spectroscopy, and artificial intelligence systems. The new techniques herein reviewed offer fresh approaches to an old problem, for which a definite solution has yet to cross the bridge from bench to IVF clinics around the world, since clinical usefulness and application remain unproven."}, {"Authors": "DJ. Wu, O. Badamjav, VV. Reddy, M. Eisenberg and B. Behr, ", "Title": "\"A preliminary study of sperm identification in microdissection testicular sperm extraction samples with deep convolutional neural networks.\", ", "Journal": "Asian journal of andrology ", "Volume": "23(2) ", "Date": "", "PubmedID": "PUBMED: 33106465; ", "DOI": "DOI 10.4103/aja.aja_66_20.", "Abstract": "Sperm identification and selection is an essential task when processing human testicular samples for in vitro fertilization. Locating and identifying sperm cell(s) in human testicular biopsy samples is labor intensive and time consuming. We developed a new computer-aided sperm analysis (CASA) system, which utilizes deep learning for near human-level performance on testicular sperm extraction (TESE), trained on a custom dataset. The system automates the identification of sperm in testicular biopsy samples. A dataset of 702 de-identified images from testicular biopsy samples of 30 patients was collected. Each image was normalized and passed through glare filters and diffraction correction. The data were split 80%, 10%, and 10% into training, validation, and test sets, respectively. Then, a deep object detection network, composed of a feature extraction network and object detection network, was trained on this dataset. The model was benchmarked against embryologists' performance on the detection task. Our deep learning CASA system achieved a mean average precision (mAP) of 0.741, with an average recall (AR) of 0.376 on our dataset. Our proposed method can work in real time; its speed is effectively limited only by the imaging speed of the microscope. Our results indicate that deep learning-based technologies can improve the efficiency of finding sperm in testicular biopsy samples."}, {"Authors": "R. Zmuidinaite, FI. Sharara and RK. Iles, ", "Title": "\"Current Advancements in Noninvasive Profiling of the Embryo Culture Media Secretome.\", ", "Journal": "International journal of molecular sciences ", "Volume": "22(5) ", "Date": "Mar. 2021", "PubmedID": "PUBMED: 33802374; ", "DOI": "DOI 10.3390/ijms22052513.", "Abstract": "There have been over 8 million babies born through in vitro fertilization (IVF) and this number continues to grow. There is a global trend to perform elective single embryo transfers, avoiding risks associated with multiple pregnancies. It is therefore important to understand where current research of noninvasive testing for embryos stands, and what are the most promising techniques currently used. Furthermore, it is important to identify the potential to translate research and development into clinically applicable methods that ultimately improve live birth and reduce time to pregnancy. The current focus in the field of human reproductive medicine is to develop a more rapid, quantitative, and noninvasive test. Some of the most promising fields of research for noninvasive assays comprise cell-free DNA analysis, microscopy techniques coupled with artificial intelligence (AI) and omics analysis of the spent blastocyst media. High-throughput proteomics and metabolomics technologies are valuable tools for noninvasive embryo analysis. The biggest advantages of such technology are that it can differentiate between the embryos that appear morphologically identical and has the potential to identify the ploidy status noninvasively prior to transfer in a fresh cycle or before vitrification for a later frozen embryo transfer."}, {"Authors": "LZ. Yanez, J. Han, BB. Behr, RAR. Pera and DB. Camarillo, ", "Title": "\"Human oocyte developmental potential is predicted by mechanical properties within hours after fertilization.\", ", "Journal": "Nature communications ", "Volume": "7 ", "Date": "Feb. 2016", "PubmedID": "PUBMED: 26904963; ", "DOI": "DOI 10.1038/ncomms10809.", "Abstract": "The causes of embryonic arrest during pre-implantation development are poorly understood. Attempts to correlate patterns of oocyte gene expression with successful embryo development have been hampered by the lack of reliable and nondestructive predictors of viability at such an early stage. Here we report that zygote viscoelastic properties can predict blastocyst formation in humans and mice within hours after fertilization, with >90% precision, 95% specificity and 75% sensitivity. We demonstrate that there are significant differences between the transcriptomes of viable and non-viable zygotes, especially in expression of genes important for oocyte maturation. In addition, we show that low-quality oocytes may undergo insufficient cortical granule release and zona-hardening, causing altered mechanics after fertilization. Our results suggest that embryo potential is largely determined by the quality and maturation of the oocyte before fertilization, and can be predicted through a minimally invasive mechanical measurement at the zygote stage. "}, {"Authors": "P. Vogiatzi, A. Pouliakis and C. Siristatidis, ", "Title": "\"An artificial neural network for the prediction of assisted reproduction outcome.\", ", "Journal": "Journal of assisted reproduction and genetics ", "Volume": "36(7) ", "Date": "Jul. 2019", "PubmedID": "PUBMED: 31218565; ", "DOI": "DOI 10.1007/s10815-019-01498-7.", "Abstract": "To construct and validate an efficient artificial neural network (ANN) based on parameters with statistical correlation to live birth, to be used as a comprehensive tool for the prediction of the clinical outcome for patients undergoing ART."}, {"Authors": "MAMM. Ferraz, HS. Rho, D. Hemerich, HHW. Henning, HTA. van Tol, M. Hölker, U. Besenfelder, M. Mokry, PLAM. Vos, TAE. Stout, S. Le Gac and BM. Gadella, ", "Title": "\"An oviduct-on-a-chip provides an enhanced in vitro environment for zygote genome reprogramming.\", ", "Journal": "Nature communications ", "Volume": "9(1) ", "Date": "Nov. 2018", "PubmedID": "PUBMED: 30467383; ", "DOI": "DOI 10.1038/s41467-018-07119-8.", "Abstract": "Worldwide over 5 million children have been conceived using assisted reproductive technology, and research has concentrated on increasing the likelihood of ongoing pregnancy. However, studies using animal models have indicated undesirable effects of in vitro embryo culture on offspring development and health. In vivo, the oviduct hosts a period in which the early embryo undergoes complete reprogramming of its (epi)genome in preparation for the reacquisition of (epi)genetic marks. We designed an oviduct-on-a-chip platform to better investigate the mechanisms related to (epi)genetic reprogramming and the degree to which they differ between in vitro and in vivo embryos. The device supports more physiological (in vivo-like) zygote genetic reprogramming than conventional IVF. This approach will be instrumental in identifying and investigating factors critical to fertilization and pre-implantation development, which could improve the quality and (epi)genetic integrity of IVF zygotes with likely relevance for early embryonic and later fetal development."}, {"Authors": "DA. Morales, E. Bengoetxea, P. Larrañaga, M. García, Y. Franco, M. Fresnada and M. Merino, ", "Title": "\"Bayesian classification for the selection of in vitro human embryos using morphological and clinical data.\", ", "Journal": "Computer methods and programs in biomedicine ", "Volume": "90(2) ", "Date": "May. 2008", "PubmedID": "PUBMED: 18190996; ", "DOI": "DOI 10.1016/j.cmpb.2007.11.018.", "Abstract": "In vitro fertilization (IVF) is a medically assisted reproduction technique that enables infertile couples to achieve successful pregnancy. Given the uncertainty of the treatment, we propose an intelligent decision support system based on supervised classification by Bayesian classifiers to aid to the selection of the most promising embryos that will form the batch to be transferred to the woman's uterus. The aim of the supervised classification system is to improve overall success rate of each IVF treatment in which a batch of embryos is transferred each time, where the success is achieved when implantation (i.e. pregnancy) is obtained. Due to ethical reasons, different legislative restrictions apply in every country on this technique. In Spain, legislation allows a maximum of three embryos to form each transfer batch. As a result, clinicians prefer to select the embryos by non-invasive embryo examination based on simple methods and observation focused on morphology and dynamics of embryo development after fertilization. This paper proposes the application of Bayesian classifiers to this embryo selection problem in order to provide a decision support system that allows a more accurate selection than with the actual procedures which fully rely on the expertise and experience of embryologists. For this, we propose to take into consideration a reduced subset of feature variables related to embryo morphology and clinical data of patients, and from this data to induce Bayesian classification models. Results obtained applying a filter technique to choose the subset of variables, and the performance of Bayesian classifiers using them, are presented."}, {"Authors": "MK. Kanakasabapathy, P. Thirumalaraju, CL. Bormann, H. Kandula, I. Dimitriadis, I. Souter, V. Yogesh, S. Kota Sai Pavan, D. Yarravarapu, R. Gupta, R. Pooniwala and H. Shafiee, ", "Title": "\"Development and evaluation of inexpensive automated deep learning-based imaging systems for embryology.\", ", "Journal": "Lab on a chip ", "Volume": "19(24) ", "Date": "Dec. 2019", "PubmedID": "PUBMED: 31755505; ", "DOI": "DOI 10.1039/c9lc00721k.", "Abstract": "Embryo assessment and selection is a critical step in an in vitro fertilization (IVF) procedure. Current embryo assessment approaches such as manual microscopy analysis done by embryologists or semi-automated time-lapse imaging systems are highly subjective, time-consuming, or expensive. Availability of cost-effective and easy-to-use hardware and software for embryo image data acquisition and analysis can significantly empower embryologists towards more efficient clinical decisions both in resource-limited and resource-rich settings. Here, we report the development of two inexpensive (<$100 and <$5) and automated imaging platforms that utilize advances in artificial intelligence (AI) for rapid, reliable, and accurate evaluations of embryo morphological qualities. Using a layered learning approach, we have shown that network models pre-trained with high quality embryo image data can be re-trained using data recorded on such low-cost, portable optical systems for embryo assessment and classification when relatively low-resolution image data are used. Using two test sets of 272 and 319 embryo images recorded on the reported stand-alone and smartphone optical systems, we were able to classify embryos based on their cell morphology with >90% accuracy."}, {"Authors": "M. Boukallel, M. Gauthier, E. Piat, J. Abadie and C. Roux, ", "Title": "\"Microrobots for in vitro fertilization applications.\", ", "Journal": "Cellular and molecular biology (Noisy-le-Grand, France) ", "Volume": "50(3) ", "Date": "May. 2004", "PubmedID": "PUBMED: 15209347; ", "DOI": "", "Abstract": "The Micromanipulation and Micro-actuation Research Group at the LAB has activities related to biological and surgical applications. Concerning cells micromanipulation, our laboratory works in collaboration with the research team \"Genetic and Reproduction\" of the Besançon's hospital (France). The global final objective is the development of an automatic intra cytoplasmic sperm injection (ICSI) device in order to improve performances and ergonomics of current devices. In the future this new device will contain various modules: module for removal of cumulus cells, modules for characterization of oocytes, microinjection module, cells transport system. The first subsystem developed is a new single cell transport system. It consists in a so-called micropusher which pushes single cells without having contact with the external environment. This micropusher is a ferromagnetic particle (from 400 x 400 x 20 microm3 to 100 x 100 x 5 microm3) which follows the movement of a permanent magnet located under the biological medium. A 2D micro-positioning table moves this magnet under the glass slide. The pusher and cells positions are measured through an optical microscope with a CCD camera located above the biological medium. The second subsystem is developed to measure oocytes mechanical stiffness in order to sort them. We have then developed a micro/nano-force sensor based on the diamagnetic levitation principle: a glass tip end-effector (with 20 microm in diameter) is fixed on the equipment which is in levitation (0.5 mm in diameter, 100 mm in length). When a force is applied to the levitated glass tip, it moves to a new equilibrium position. Thanks to themeasurement of this displacement, the applied force can be measured. Since there is no contact and friction between the levitated tip and the fixed part, the resolution of this sensor is very high (10 nN)."}, {"Authors": "CL. Bormann, CL. Curchoe, P. Thirumalaraju, MK. Kanakasabapathy, R. Gupta, R. Pooniwala, H. Kandula, I. Souter, I. Dimitriadis and H. Shafiee, ", "Title": "\"Deep learning early warning system for embryo culture conditions and embryologist performance in the ART laboratory.\", ", "Journal": "Journal of assisted reproduction and genetics ", "Volume": "38(7) ", "Date": "Jul. 2021", "PubmedID": "PUBMED: 33904010; ", "DOI": "DOI 10.1007/s10815-021-02198-x.", "Abstract": "Staff competency is a crucial component of the in vitro fertilization (IVF) laboratory quality management system because it impacts clinical outcomes and informs the key performance indicators (KPIs) used to continuously monitor and assess culture conditions. Contemporary quality control and assurance in the IVF lab can be automated (collect, store, retrieve, and analyze), to elevate quality control and assurance beyond the cursory monthly review. Here we demonstrate that statistical KPI monitoring systems for individual embryologist performance and culture conditions can be detected by artificial intelligence systems to provide systemic, early detection of adverse outcomes, and identify clinically relevant shifts in pregnancy rates, providing critical validation for two statistical process controls proposed in the Vienna Consensus Document; intracytoplasmic sperm injection (ICSI) fertilization rate and day 3 embryo quality."}, {"Authors": "C. Simon, ", "Title": "\"Consensus vision.\", ", "Journal": "Fertility and sterility ", "Volume": "116(1) ", "Date": "Jul. 2021", "PubmedID": "PUBMED: 34148581; ", "DOI": "DOI 10.1016/j.fertnstert.2021.05.090.", "Abstract": "The goal of this Views and Interviews series was to bring together the thought leaders in the field and envision what the laboratory will look like in the future. This consensus piece strives to take the thoughts of those leaders and develop themes and concepts that will be significant in the laboratory in the coming years."}, {"Authors": "CL. Curchoe, ", "Title": "\"The paper chase and the big data arms race.\", ", "Journal": "Journal of assisted reproduction and genetics ", "Volume": "38(7) ", "Date": "Jul. 2021", "PubmedID": "PUBMED: 33715133; ", "DOI": "DOI 10.1007/s10815-021-02122-3.", "Abstract": ""}, {"Authors": "S. Ueno, J. Berntsen, M. Ito, K. Uchiyama, T. Okimura, A. Yabuuchi and K. Kato, ", "Title": "\"Pregnancy prediction performance of an annotation-free embryo scoring system on the basis of deep learning after single vitrified-warmed blastocyst transfer: a single-center large cohort retrospective study.\", ", "Journal": "Fertility and sterility ", "Volume": "116(4) ", "Date": "Oct. 2021", "PubmedID": "PUBMED: 34246469; ", "DOI": "DOI 10.1016/j.fertnstert.2021.06.001.", "Abstract": "To analyze the performance of an annotation-free embryo scoring system on the basis of deep learning for pregnancy prediction after single vitrified blastocyst transfer (SVBT) compared with the performance of other blastocyst grading systems dependent on annotation or morphology scores."}, {"Authors": "H. Wu, X. Xu, C. Ma, Y. Zhou, S. Pei, H. Geng, Y. He, Q. Xu, Y. Xu, X. He, P. Zhou, Z. Wei, X. Xu and Y. Cao, ", "Title": "\"No significant long-term complications from inadvertent exposure to gonadotropin-releasing hormone agonist during early pregnancy in mothers and offspring: a retrospective analysis.\", ", "Journal": "Reproductive biology and endocrinology : RB&E ", "Volume": "19(1) ", "Date": "Mar. 2021", "PubmedID": "PUBMED: 33743741; ", "DOI": "DOI 10.1186/s12958-021-00732-1.", "Abstract": "Administration of gonadotropin-releasing hormone agonist (GnRH-a) in the luteal phase is commonly used for pituitary suppression during in vitro fertilisation (IVF). There is an ineluctable risk of inadvertent exposure of spontaneous pregnancy to GnRH-a. However, little is known about the pregnancy complications and repregnancy outcomes of the affected women and the neurodevelopmental outcomes of the GnRH-a-exposed children."}, {"Authors": "J. Nie, L. An, K. Miao, Z. Hou, Y. Yu, K. Tan, L. Sui, S. He, Q. Liu, X. Lei, Z. Wu and J. Tian, ", "Title": "\"Comparative analysis of dynamic proteomic profiles between in vivo and in vitro produced mouse embryos during postimplantation period.\", ", "Journal": "Journal of proteome research ", "Volume": "12(9) ", "Date": "Sep. 2013", "PubmedID": "PUBMED: 23841881; ", "DOI": "DOI 10.1021/pr301044b.", "Abstract": "Assisted reproductive technology (ART) increasingly is associated with long-term side-effects on postnatal development and behaviors. High-throughput gene expression analysis has been extensively used to explore mechanisms responsible for these disorders. Our study, for the first time, provides a comparative proteomic analysis between embryos after in vivo fertilization and development (IVO, control) and in vitro fertilization and culture (IVP). By comparing the dynamic proteome during the postimplantation period, we identified 300 and 262 differentially expressed proteins (DEPs) between IVO and IVP embryos at embryonic day 7.5 (E7.5) and E10.5, respectively. Bioinformatic analysis showed many DEPs functionally associated with post-transcriptional, translational, and post-translational regulation, and these observations were consistent with correlation analysis between mRNA and protein abundance. In addition to altered gene expression due to IVP procedures, our findings suggest that aberrant processes at these various levels also contributed to proteomic alterations. In addition, numerous DEPs were involved in energy and amino acid metabolism, as well as neural and sensory development. These DEPs are potential candidates for further exploring the mechanism(s) of ART-induced intrauterine growth restriction and neurodevelopmental disorders. Moreover, significant enrichment of DEPs in pathways of neurodegenerative diseases implies the potentially increased susceptibility of ART offspring to these conditions as adults. "}, {"Authors": "K. Lundin and H. Park, ", "Title": "\"Time-lapse technology for embryo culture and selection.\", ", "Journal": "Upsala journal of medical sciences ", "Volume": "125(2) ", "Date": "May. 2020", "PubmedID": "PUBMED: 32096675; ", "DOI": "DOI 10.1080/03009734.2020.1728444.", "Abstract": "Culturing of human embryos in optimal conditions is crucial for a successful in vitro fertilisation (IVF) programme. In addition, the capacity to assess and rank embryos correctly for quality will allow for transfer of the potentially 'best' embryo first, thereby shortening the time to pregnancy, although not improving cumulative pregnancy and live birth rates. It will also encourage and facilitate the implementation of single embryo transfers, thereby increasing safety for mother and offspring. Time-lapse technology introduces the concept of stable culture conditions, in connection with the possibility of continuous viewing and documenting of the embryo throughout development. However, so far, even when embryo quality scoring is based on large datasets, or when using the time-lapse technology, the morphokinetic scores are still mainly based on subjective and intermittent annotations of morphology and timings. Also, the construction of powerful algorithms for widespread use is hampered by large variations in culture conditions between individual IVF laboratories. New methodology, involving machine learning, where every image from the time-lapse documentation is analysed by a computer programme, looking for patterns that link to outcome, may in the future provide a more accurate and non-biased embryo selection."}, {"Authors": "SK. Mirsky, I. Barnea, M. Levi, H. Greenspan and NT. Shaked, ", "Title": "\"Automated analysis of individual sperm cells using stain-free interferometric phase microscopy and machine learning.\", ", "Journal": "Cytometry. Part A : the journal of the International Society for Analytical Cytology ", "Volume": "91(9) ", "Date": "Sep. 2017", "PubmedID": "PUBMED: 28834185; ", "DOI": "DOI 10.1002/cyto.a.23189.", "Abstract": "Currently, the delicate process of selecting sperm cells to be used for in vitro fertilization (IVF) is still based on the subjective, qualitative analysis of experienced clinicians using non-quantitative optical microscopy techniques. In this work, a method was developed for the automated analysis of sperm cells based on the quantitative phase maps acquired through use of interferometric phase microscopy (IPM). Over 1,400 human sperm cells from 8 donors were imaged using IPM, and an algorithm was designed to digitally isolate sperm cell heads from the quantitative phase maps while taking into consideration both the cell 3D morphology and contents, as well as acquire features describing sperm head morphology. A subset of these features was used to train a support vector machine (SVM) classifier to automatically classify sperm of good and bad morphology. The SVM achieves an area under the receiver operating characteristic curve of 88.59% and an area under the precision-recall curve of 88.67%, as well as precisions of 90% or higher. We believe that our automatic analysis can become the basis for objective and automatic sperm cell selection in IVF. © 2017 International Society for Advancement of Cytometry."}, {"Authors": "D. Dirvanauskas, R. Maskeliunas, V. Raudonis and R. Damasevicius, ", "Title": "\"Embryo development stage prediction algorithm for automated time lapse incubators.\", ", "Journal": "Computer methods and programs in biomedicine ", "Volume": "177 ", "Date": "Aug. 2019", "PubmedID": "PUBMED: 31319944; ", "DOI": "DOI 10.1016/j.cmpb.2019.05.027.", "Abstract": "Time-lapse microscopy has become an important tool for studying the embryo development process. Embryologists can monitor the entire embryo growth process and thus select the best embryos for fertilization. This time and the resource consuming process are among the key factors for success of pregnancies. Tools for automated evaluation of the embryo quality and development stage prediction are developed for improving embryo selection."}, {"Authors": "D. Srivastava, S. Gupta, S. Kudavelly, VS. K and R. Ga, ", "Title": "\"Unsupervised Deep Learning based Longitudinal Follicular Growth Tracking during IVF Cycle using 3D Transvaginal Ultrasound in Assisted Reproduction.\", ", "Journal": "Annual International Conference of the IEEE Engineering in Medicine and Biology Society. IEEE Engineering in Medicine and Biology Society. Annual International Conference ", "Volume": "2021 ", "Date": "Nov. 2021", "PubmedID": "PUBMED: 34891924; ", "DOI": "DOI 10.1109/EMBC46164.2021.9630495.", "Abstract": "Longitudinal follicle tracking is needed in clinical practice for diagnosis and management in assisted reproduction. Follicles are tracked over the in-vitro fertilization (IVF) cycle, and this analysis is usually performed manually by a medical practitioner. It is a challenging manual analysis and is prone to error as it is largely operator dependent. In this paper we propose a two-stage framework to address the clinical need for follicular growth tracking. The first stage comprises of an unsupervised deep learning network SFR-Net to automate registration of each and every follicle across the IVF cycle. SFR-Net is composed of the standard 3DUNet [1] and Multi-Scale Residual Blocks (MSRB) [2] in order to register follicles of varying sizes. In the second stage we use the registration result to track individual follicles across the IVF cycle. The 3D Transvaginal Ultrasound (3D TVUS) volumes were acquired from 26 subjects every 2-3 days, resulting in a total of 96 volume pairs for the registration and tracking task. On the test dataset we have achieved an average DICE score of 85.84% for the follicle registration task, and we are successfully able to track follicles above 4 mm. Ours is the novel attempt towards automated tracking of follicular growth [3].Clinical Relevance- Accurate tracking of follicle count and growth is of paramount importance to increase the effectiveness of IVF procedure. Correct predictions can help doctors provide better counselling to the patients and individualize treatment for ovarian stimulation. Favorable outcome of this assisted reproductive technique depends on the estimates of the quality and quantity of the follicular pool. Therefore, automated longitudinal tracking of follicular growth is highly demanded in Assisted Reproduction clinical practice. [4]."}, {"Authors": "C. Shi, HJ. Han, LJ. Fan, J. Guan, XB. Zheng, X. Chen, R. Liang, XW. Zhang, KK. Sun, QH. Cui and H. Shen, ", "Title": "\"Diverse endometrial mRNA signatures during the window of implantation in patients with repeated implantation failure.\", ", "Journal": "Human fertility (Cambridge, England) ", "Volume": "21(3) ", "Date": "Sep. 2018", "PubmedID": "PUBMED: 28523980; ", "DOI": "DOI 10.1080/14647273.2017.1324180.", "Abstract": "High endometrial receptivity in the window of implantation (WOI) is essential for successful implantation. However, a diagnostic tool with high specificity for impaired endometrial receptivity remains to be developed. We collected endometrium specimens during the WOI from patients with RIF and women who conceived after one IVF/ICSI attempt. We conducted mRNA microarray on the samples followed by relevant comparative and functional analysis. Microarray analysis revealed 357 dysregulated mRNAs between the two groups. The majority of these mRNAs were found to encode membrane proteins by Gene Ontology (GO) analysis. The major functional biological pathways associated with the down-regulated mRNAs were cytokine-cytokine receptor interaction, the p53 signalling pathway and the complement and coagulation cascades. Up-regulated mRNAs were found mainly to participate in pathways such as PPAR signalling, hematopoietic cell lineage, phosphatidylinositol signalling system, ECM-receptor interaction and notch signalling. AQP3, DPP4 and TIMP3 whose expression patterns were down-regulated in RIF patients both by microarray and real-time PCR had a high correspondence with previous studies demonstrating that these genes may contribute to the defects in endometrial receptivity in RIF patients. Overall, these RIF-associated mRNAs may help devise new diagnostic tools for endometrial receptivity."}, {"Authors": "M. Brązert, W. Kranc, P. Celichowski, M. Jankowski, H. Piotrowska-Kempisty, L. Pawelczyk, M. Bruska, M. Zabel, M. Nowicki and B. Kempisty, ", "Title": "\"Expression of genes involved in neurogenesis, and neuronal precursor cell proliferation and development: Novel pathways of human ovarian granulosa cell differentiation and transdifferentiation capability in vitro.\", ", "Journal": "Molecular medicine reports ", "Volume": "21(4) ", "Date": "Apr. 2020", "PubmedID": "PUBMED: 32319615; ", "DOI": "DOI 10.3892/mmr.2020.10972.", "Abstract": "The process of neural tissue formation is associated primarily with the course of neurogenesis during embryonic life. The source of neural‑like cells is stem cells, which, under the influence of appropriate differentiating factors, may differentiate/transdifferentiate towards a neural‑like lineage. The present study suggested that, under long‑term in vitro culture conditions, human ovarian granulosa cells (GCs), obtained from granulosa‑rich follicular fluid, acquired new properties and expressed genes characteristic of the ontological groups 'neurogenesis' (GO:0022008), 'neuronal precursor cell proliferation' (GO:0061351) and 'nervous system development' (GO:0007399), which are closely related to the formation of neurons. The present study collected GCs from 20 women referred for the procedure of in vitro fertilization. Cells were maintained in long‑term in vitro culture for 30 days, and RNA was isolated after 1, 7, 15 and 30 days of culture. The expression profile of individual genes was determined using the Affymetrix microarray method. The 131 genes with the highest expression change in relation to day 1 of culture were then selected; the 10 most affected genes found to be primarily involved in nerve cell formation processes were chosen for consideration in this study: CLDN11, OXTR, DFNA5, ATP8B1, ITGA3, CD9, FRY, NANOS1, CRIM1 and NTN4. The results of the present study revealed that these genes may be considered potential markers of the uninduced differentiation potential of GCs. In addition, it was suggested that GCs may be used to develop a cell line showing neuronal characteristics after 30 days of cultivation. In addition, due to their potential, these cells could possibly be used in the treatment of neurodegenerative diseases, not only in the form of 'cultured neurons' but also as producers of factors involved in the regeneration of the nervous system."}, {"Authors": "A. Uyar, A. Bener, H. Ciray and M. Bahceci, ", "Title": "\"A frequency based encoding technique for transformation of categorical variables in mixed IVF dataset.\", ", "Journal": "Annual International Conference of the IEEE Engineering in Medicine and Biology Society. IEEE Engineering in Medicine and Biology Society. Annual International Conference ", "Volume": "2009 ", "Date": "2009", "PubmedID": "PUBMED: 19964898; ", "DOI": "DOI 10.1109/IEMBS.2009.5334548.", "Abstract": "Implantation prediction of in-vitro fertilization (IVF) embryos is critical for the success of the treatment. In this study, Support Vector Machine (SVM) method has been used on an original IVF dataset for classification of embryos according to implantation potentials. The dataset we analyzed includes both categorical and continuous feature values. Transformation of categorical variables into numeric attributes is an important pre-processing stage for SVM affecting the performance of the classification. We have proposed a frequency based encoding technique for transformation of categorical variables. Experimental results revealed that, the proposed technique significantly improved the performance of IVF implantation prediction in terms of Area Under ROC curve (0.712+/-0.032) compared to common binary encoding and expert judgement based transformation methods (0.676+/-0.033 and 0.696 +/- 0.024, respectively)."}, {"Authors": "P. Ntostis, G. Kokkali, D. Iles, J. Huntriss, M. Tzetis, H. Picton, K. Pantos and D. Miller, ", "Title": "\"Can trophectoderm RNA analysis predict human blastocyst competency?,\" ", "Journal": "Systems biology in reproductive medicine ", "Volume": "65(4) ", "Date": "Aug. 2019", "PubmedID": "PUBMED: 31244343; ", "DOI": "DOI 10.1080/19396368.2019.1625085.", "Abstract": "A systematic review of the literature showed that trophectoderm biopsy could assist in the selection of healthy embryos for uterine transfer without affecting implantation rates. However, previous studies attempting to establish the relationship between trophectoderm gene expression profiles and implantation competency using either microarrays or RNA sequencing strategies, were not sufficiently optimized to handle the exceptionally low RNA inputs available from biopsied material. In this pilot study, we report that differential gene expression in human trophectoderm biopsies assayed by an ultra-sensitive next generation RNA sequencing strategy could predict blastocyst implantation competence. RNA expression profiles from isolated human trophectoderm cells were analysed with established clinical pregnancy being the primary endpoint. Following RNA sequencing, a total of 47 transcripts were found to be significantly differentially expressed between the trophectoderm cells from successfully implanted (competent) versus unsuccessful (incompetent) blastocysts. Of these, 36 transcripts were significantly down-regulated in the incompetent blastocysts, including Hydroxysteroid 17-Beta Dehydrogenase 1 (HSD17B1) and Cytochrome P450 Family 11 Subfamily A Member 1 (CYP11A1), while the remaining 11 transcripts were significantly up-regulated, including BCL2 Antagonist/Killer 1 (BAK1) and KH Domain Containing 1 Pseudogene 1 (KHDC1P1) of which the latter was always detected in the incompetent and absent in all competent blastocysts. Ontological analysis of differentially expressed RNAs revealed pathways involved in steroidogenic processes with high confidence. Novel differentially expressed transcripts were also noted by reference to a de novo sequence assembly. The selection of the blastocyst with the best potential to support full-term pregnancy following single embryo transfer could reduce the need for multiple treatment cycles and embryo transfers. The main limitation was the low sample size (N = 8). Despite this shortcoming, the pilot suggests that trophectoderm biopsy could assist with the selection of healthy embryos for embryo transfer. A larger cohort of samples is needed to confirm these findings. Abbreviations: AMA: advanced maternal age; ART: assisted reproductive technology; CP: clinical pregnancy; DE: differential expression; FDR: false discovery rate; IVF: in vitro fertilization; LD PCR: long distance PCR; qRT-PCR: quantitative real-time PCR; SET: single embryo transfer; TE: trophectoderm."}, {"Authors": "S. Giscard d'Estaing, E. Labrune, M. Forcellini, C. Edel, B. Salle, J. Lornage and M. Benchaib, ", "Title": "\"A machine learning system with reinforcement capacity for predicting the fate of an ART embryo.\", ", "Journal": "Systems biology in reproductive medicine ", "Volume": "67(1) ", "Date": "Feb. 2021", "PubmedID": "PUBMED: 33719832; ", "DOI": "DOI 10.1080/19396368.2020.1822953.", "Abstract": "The aim of this work was to construct a score issued from a machine learning system with self-improvement capacity able to predict the fate of an ART embryo incubated in a time lapse monitoring (TLM) system. A retrospective study was performed. For the training data group, 110 couples were included and, 891 embryos were cultured. For the global setting data group, 201 couples were included, and 1186 embryos were cultured. No image analysis was used; morphokinetic parameters from the first three days of embryo culture were used to perform a logistic regression between the cell number and time. A score named DynScore was constructed, the prediction power of the DynScore on blastocyst formation and the baby delivery were tested via the area under the curve (AUC) obtained from the receiver operating characteristic (ROC). In the training data group, the DynScore allowed the blastocyst formation prediction (AUC = 0.634, p < 0.001), this approach was the higher among the set of the tested scores. Similar results were found with the global setting data group (AUC = 0.638, p < 0.001) and it was possible to increase the AUC of the DynScore with a regular update of the prediction system by reinforcement, with an AUC able to reach a value above 0.9. As only the best blastocysts were transferred, none of the tested scores was able to predict delivery. In conclusion, the DynScore seems to be able to predict the fate of an embryo. The reinforcement of the prediction system allows maintaining the predictive capacity of DynScore irrespective of the various events that may occur during the ART process. The DynScore could be implemented in any TLM system and adapted by itself to the data of any ART center.Abbreviations: ART: assisted reproduction technology; TLM: time lapse monitoring system; AUC: area under the curve; ROC: receiver operating characteristic; eSET: elective single embryo transfer; AIS: artificial intelligence system; KID: known implantation data; AMH: anti-Müllerian hormone; BMI: body mass index; WHO: World Health Organization; c-IVF: conventional in-vitro fertilization; ICSI: intracytoplasmic sperm injection; PNf: pronuclear formation; D3: day 3; D5: day 5; D6: day 6; GnRH: gonadotrophin releasing hormone; FSH: follicle stimulating hormone; LH: luteinizing hormone; hCG: human chorionic gonadotropin; PVP: polyvinyl pyrrolidone; PNf: time of pronuclear fading; tx: time of cleavage to x blastomeres embryo; ICM: inner cell mass; TE: trophectoderm; NbCellt: number of cells at t time; FIFO: first in first out; TD: training data group; SD: setting data group; R: real world."}, {"Authors": "B. Lunenfeld, W. Bilger, S. Longobardi, J. Kirsten, T. D'Hooghe and SK. Sunkara, ", "Title": "\"Decision points for individualized hormonal stimulation with recombinant gonadotropins for treatment of women with infertility.\", ", "Journal": "Gynecological endocrinology : the official journal of the International Society of Gynecological Endocrinology ", "Volume": "35(12) ", "Date": "Dec. 2019", "PubmedID": "PUBMED: 31392906; ", "DOI": "DOI 10.1080/09513590.2019.1650345.", "Abstract": "It is essential that fertility treatment is individualized based on a thorough diagnostic work-up, with treatment tailored to the patients' requirements. This individualization should be kept in mind during the main decision points that occur before and during treatment. Treatment customization must include consideration of both the woman and her partner involved in the process together, including their collective treatment goals. Once treatment goals have been agreed and diagnostic evaluations performed, personalization based on patient characteristics, together with an understanding of treatment goals and patient preferences, enables the selection of appropriate treatments, protocols, products and their dosing. Following treatment initiation, monitoring and adaptation of product and dose can then ensure optimal outcomes. Currently, it is not possible to base treatment decisions on every characteristic of the patient and personalization is based on biomarkers that have been identified as the most relevant. However, in the future, the use of artificial intelligence coupled with continuous monitoring should enable greater individualization and improve outcomes. This review considers the current state-of-the-art related to decision points during individualized treatment of female infertility, before looking at future developments that might further assist in making individualized treatment decisions, including the use of computer-assisted decision making."}, {"Authors": "B. Chermuła, W. Kranc, K. Jopek, J. Budna-Tukan, G. Hutchings, C. Dompe, L. Moncrieff, K. Janowicz, M. Józkowiak, M. Jeseta, J. Petitte, P. Mozdziak, L. Pawelczyk, RZ. Spaczyński and B. Kempisty, ", "Title": "\"Human Cumulus Cells in Long-Term In Vitro Culture Reflect Differential Expression Profile of Genes Responsible for Planned Cell Death and Aging-A Study of New Molecular Markers.\", ", "Journal": "Cells ", "Volume": "9(5) ", "Date": "May. 2020", "PubmedID": "PUBMED: 32455542; ", "DOI": "DOI 10.3390/cells9051265.", "Abstract": "In the ovarian follicle, maturation of the oocyte increases in the presence of somatic cells called cumulus cells (CCs). These cells form a direct barrier between the oocyte and external environment. Thanks to bidirectional communication, they have a direct impact on the oocyte, its quality and development potential. Understanding the genetic profile of CCs appears to be important in elucidating the physiology of oocytes. Long-term in vitro culture of CCs collected from patients undergoing controlled ovarian stimulation during in vitro fertilization procedure was conducted. Using microarray expression analysis, transcript levels were assessed on day 1, 7, 15, and 30 of culture. Apoptosis and aging of CCs strictly influence oocyte quality and subsequently the outcome of assisted reproductive technologies (ART). Thus, particular attention was paid to the analysis of genes involved in programmed cell death, aging, and apoptosis. Due to the detailed level of expression analysis of each of the 133 analyzed genes, three groups were selected: first with significantly decreased expression during the culture; second with the statistically lowest increase in expression; and third with the highest significant increase in expression. COL3A1, SFRP4, CTGF, HTR2B, VCAM1, TNFRSF11B genes, belonging to the third group, were identified as potential carriers of information on oocyte quality."}, {"Authors": "Z. Jiang, P. Harrington, M. Zhang, SL. Marjani, J. Park, L. Kuo, C. Pribenszky and XC. Tian, ", "Title": "\"Effects of High Hydrostatic Pressure on Expression Profiles of In Vitro Produced Vitrified Bovine Blastocysts.\", ", "Journal": "Scientific reports ", "Volume": "6 ", "Date": "Feb. 2016", "PubmedID": "PUBMED: 26883277; ", "DOI": "DOI 10.1038/srep21215.", "Abstract": "High hydrostatic pressure (HHP) has been used to pre-condition embryos before essential, yet potentially detrimental procedures such as cryopreservation. However, the mechanisms for HHP are poorly understood. We treated bovine blastocysts with three different HHP (40, 60 and 80 MPa) in combination with three recovery periods (0, 1 h, 2 h post HHP). Re-expansion rates were significantly higher at 40 and 60 but lower at 80 MPa after vitrification-warming in the treated groups than controls. Microarray analysis revealed 399 differentially expressed transcripts, representing 254 unique genes, among different groups. Gene ontology analysis indicated that HHP at 40 and 60 MPa promoted embryo competence through down-regulation of genes in cell death and apoptosis, and up-regulation of genes in RNA processing, cellular growth and proliferation. In contrast, 80 MPa up-regulated genes in apoptosis, and down-regulated protein folding and cell cycle-related genes. Moreover, gene expression was also influenced by the length of the recovery time after HHP. The significantly over-represented categories were apoptosis and cell death in the 1 h group, and protein folding, response to unfolded protein and cell cycle in the 2 h group compared to 0 h. Taken together, HHP promotes competence of vitrified bovine blastocysts through modest transcriptional changes."}, {"Authors": "S. Canovas, E. Ivanova, M. Hamdi, F. Perez-Sanz, D. Rizos, G. Kelsey and P. Coy, ", "Title": "\"Culture Medium and Sex Drive Epigenetic Reprogramming in Preimplantation Bovine Embryos.\", ", "Journal": "International journal of molecular sciences ", "Volume": "22(12) ", "Date": "Jun. 2021", "PubmedID": "PUBMED: 34204008; ", "DOI": "DOI 10.3390/ijms22126426.", "Abstract": "Assisted reproductive technologies impact transcriptome and epigenome of embryos and can result in long-term phenotypic consequences. Whole-genome DNA methylation profiles from individual bovine blastocysts in vivo- and in vitro-derived (using three sources of protein: reproductive fluids, blood serum and bovine serum albumin) were generated. The impact of in vitro culture on DNA methylation was analyzed, and sex-specific methylation differences at blastocyst stage were uncovered. In vivo embryos showed the highest levels of methylation (29.5%), close to those produced in vitro with serum, whilst embryos produced in vitro with reproductive fluids or albumin showed less global methylation (25-25.4%). During repetitive element analysis, the serum group was the most affected. DNA methylation differences between in vivo and in vitro groups were more frequent in the first intron than in CpGi in promoters. Moreover, hierarchical cluster analysis showed that sex produced a stronger bias in the results than embryo origin. For each group, distance between male and female embryos varied, with in vivo blastocyst showing a lesser distance. Between the sexually dimorphic methylated tiles, which were biased to X-chromosome, critical factors for reproduction, developmental process, cell proliferation and DNA methylation machinery were included. These results support the idea that blastocysts show sexually-dimorphic DNA methylation patterns, and the known picture about the blastocyst methylome should be reconsidered."}, {"Authors": "N. Basile, I. Elkhatib and M. Meseguer, ", "Title": "\"A Strength, Weaknesses, Opportunities and Threats analysis on time lapse.\", ", "Journal": "Current opinion in obstetrics & gynecology ", "Volume": "31(3) ", "Date": "Jun. 2019", "PubmedID": "PUBMED: 30925520; ", "DOI": "DOI 10.1097/GCO.0000000000000534.", "Abstract": "The study of embryonic development through conventional microscopy has contributed significantly to the success of IVF. However, clinical pregnancy rates per transfer remain as low as 30% according to the latest records of European society if human reproduction and society if assisted reproduction. Considering the increased need to reduce the number of multiple pregnancies, the embryologist is required to improve embryo selection methods to reduce the number of embryos transferred and identify those with the highest implantation potential. This represents a big challenge considering that applying this strategy could jeopardize the overall success rates. New strategies have been proposed including the use of time-lapse systems among others. Although this technology has been used for a decade in IVF labs controversies still exist regarding its potential to substitute conventional morphology for embryo evaluation."}, {"Authors": "M. Kulus, W. Kranc, K. Wojtanowicz-Markiewicz, P. Celichowski, A. Światły-Błaszkiewicz, E. Matuszewska, P. Sujka-Kordowska, A. Konwerska, M. Zdun, R. Bryl, M. Wieczorkiewicz, J. Kulus, B. Stelmach, K. Stefańska, J. Budna-Tukan, JN. Petitte, P. Mozdziak, K. Ratajczak, J. Matysiak, JM. Jaśkowski, M. Nowicki and B. Kempisty, ", "Title": "\"New Gene Markers Expressed in Porcine Oviductal Epithelial Cells Cultured Primary In Vitro Are Involved in Ontological Groups Representing Physiological Processes of Porcine Oocytes.\", ", "Journal": "International journal of molecular sciences ", "Volume": "22(4) ", "Date": "Feb. 2021", "PubmedID": "PUBMED: 33669854; ", "DOI": "DOI 10.3390/ijms22042082.", "Abstract": "Changes that occur within oviducts after fertilization are dependent on post-ovulation events, including oocyte-oviduct interactions. Although general processes are well-defined, the molecular basis are poorly understood. Recently, new marker genes involved in 'cell development', 'cell growth', 'cell differentiation' and 'cell maturation' processes have been identified in porcine oocytes. The aim of the study was to assess the expression profile of genes in primary in vitro cultured oviductal epithelial cells (OECs), clustered in Gene Ontology groups which enveloped markers also identified in porcine oocytes. OECs (from 45 gilts) were surgically removed and cultured in vitro for ≤ 30 days, and then subjected to molecular analyses. The transcriptomic and proteomic profiles of cells cultured during 7, 15 and 30 days were investigated. Additionally, morphological/histochemical analyzes were performed. The results of genes expression profiles were validated after using RT-qPCR. The results showed a significant upregulation of UNC45B, NOX4, VLDLR, ITGB3, FMOD, SGCE, COL1A2, LOX, LIPG, THY1 and downregulation of SERPINB2, CD274, TXNIP, CELA1, DDX60, CRABP2, SLC5A1, IDO1, ANPEP, FST. Detailed knowledge of the molecular pathways occurring in the OECs and the gametes that contact them may contribute both to developments of basic science of physiology, and new possibilities in advanced biotechnology of assisted reproduction."}, {"Authors": "Y. Chen, H. Wei, Y. Liu, F. Gao, Z. Chen, P. Wang, L. Li and S. Zhang, ", "Title": "\"Identification of new protein biomarkers associated with the boar fertility using iTRAQ-based quantitative proteomic analysis.\", ", "Journal": "International journal of biological macromolecules ", "Volume": "162 ", "Date": "Nov. 2020", "PubmedID": "PUBMED: 32553959; ", "DOI": "DOI 10.1016/j.ijbiomac.2020.06.102.", "Abstract": "In this study, we performed the isobaric tags for relative and absolute quantitation (iTRAQ) proteomic analysis in the spermatozoa of Landrace boars with different fertility potentials and investigated the ability of sperm acrosome associated 4 (SPACA4) and IZUMO family member 2 (IZUMO2) to predict the reproductive perform of boars. The iTRAQ results revealed that 202 proteins were up-regulated and 43 proteins were down-regulated in the spermatozoa from high fertility boars. SPACA4 and IZUMO2 protein levels were significantly up-regulated in the spermatozoa from high fertility boars. SPACA4 and IZUMO2 expression were specifically detected in the adult boar testis. SPACA4 levels were positively correlated with Sow's farrowing rate and reproductive efficiency, but not litter size. IZUMO2 were positively correlated with litter size, Sow's farrowing rate and reproductive efficiency. Treating the boar semen with SPACA4 or IZUMO2 antibodies for 30 min and 60 min failed to affect the sperm motility; while treating the semen with SPACA4 antibody significantly reduced the fertilization and cleavage rates. Similar results for fertilization and cleavage rates were found in IZUMO2 antibody-treated semen. Collectively, our results indicated that protein levels of SPACA4 and IZUMO2 in the spermatozoa were positively related to the reproductive performance of Landrace boars."}, {"Authors": "J. Budna, A. Bryja, P. Celichowski, W. Kranc, S. Ciesiółka, S. Borys, M. Rybska, A. Kolecka-Bednarczyk, M. Jeseta, D. Bukowska, P. Antosik, KP. Brüssow, M. Bruska, M. Nowicki, M. Zabel and B. Kempisty, ", "Title": "\"\"Bone Development\" Is an Ontology Group Upregulated in Porcine Oocytes Before In Vitro Maturation: A Microarray Approach.\", ", "Journal": "DNA and cell biology ", "Volume": "36(8) ", "Date": "Aug. 2017", "PubmedID": "PUBMED: 28574720; ", "DOI": "DOI 10.1089/dna.2017.3677.", "Abstract": "Mammalian cumulus-oocyte complexes (COCs) reach full developmental capability during folliculogenesis and oogenesis. It is well recognized that only gametes achieving MII stage after in vivo or in vitro maturation (IVM) are successfully fertilized by a single spermatozoon. Although the process of oocyte nuclear and/or cytoplasmic maturation in pigs is well determined, there exist many differences that promote these processes in vivo and in vitro. Therefore, this study aimed to investigate the differences in RNA expression profiles between porcine oocytes before and after IVM using microarray and real-time quantitative polymerase chain reaction (RT-qPCR) assays. Experiments were performed on oocytes isolated from 55 pubertal crossbred Landrace gilts. The oocytes were analyzed both before and after IVM and only Brilliant Cresyl Blue (BCB)-positive gametes were used for subsequent microarray analysis (Affymetrix) and RT-qPCR analysis. The microarray assay, which measures expression of 12,258 transcripts, revealed 419 differentially expressed transcripts in porcine oocytes, from which 379 were downregulated and 40 were upregulated before IVM compared to those analyzed after IVM. After DAVID analysis, we found eight different transcripts, including IHH, BMP1, WWTR1, CHRDL1, KLF10, EIF2AK3, MMP14, and STC1. Their expression is related to the \"bone development\" ontology group and was further subjected to hierarchical clusterization. Using RT-qPCR analysis, we confirmed the results of the microarray assay, showing increased expression of the eight genes in oocytes before IVM compared to oocytes after maturation in vitro. It has been suggested that \"bone development\" belongs to one ontological group involving genes substantially upregulated in porcine oocytes before IVM. We suggest that the gamete mRNA expression profile before IVM may comprise stored transcripts, which are templates for protein biosynthesis following fertilization. We also hypothesize that these mRNAs may be a specific \"fingerprint\" of folliculogenesis and oogenesis in pigs."}, {"Authors": "SJ. Kaufmann, JL. Eastaugh, S. Snowden, SW. Smye and V. Sharma, ", "Title": "\"The application of neural networks in predicting the outcome of in-vitro fertilization.\", ", "Journal": "Human reproduction (Oxford, England) ", "Volume": "12(7) ", "Date": "Jul. 1997", "PubmedID": "PUBMED: 9262277; ", "DOI": "", "Abstract": "Infertility affects one in six couples at some time in their lives, with 48% of these couples requiring assisted conception techniques in order to achieve a pregnancy. Whilst the overall clinical pregnancy rate per embryo transfer is 23%, this varies widely between clinics. The Human Fertilisation and Embryology Authority has attempted to analyse the results of all units, with weighting of different factors affecting assisted conception, and the published data have invariably led to comparisons between units. However, statistical models need to be developed to eliminate bias for valid comparisons. Neural networks offer a novel approach to pattern recognition. In some instances neural networks can identify a wider range of associations than other statistical techniques due in part to their ability to recognize highly non-linear associations. It was hoped that a neural network approach may be able to predict success for individual couples about to undergo in-vitro fertilization (IVF) treatment. A neural network was constructed using the variables of age, number of eggs recovered, number of embryos transferred and whether there was embryo freezing. Overall the network managed to achieve an accuracy of 59%."}, {"Authors": "C. Lönnerfors and J. Persson, ", "Title": "\"Pregnancy following robot-assisted laparoscopic myomectomy in women with deep intramural myomas.\", ", "Journal": "Acta obstetricia et gynecologica Scandinavica ", "Volume": "90(9) ", "Date": "Sep. 2011", "PubmedID": "PUBMED: 21644937; ", "DOI": "DOI 10.1111/j.1600-0412.2011.01207.x.", "Abstract": "To describe fecundity after robot-assisted laparoscopic myomectomy for deep intramural myomas."}, {"Authors": "L. Bianchi, A. Gagliardi, C. Landi, R. Focarelli, V. De Leo, A. Luddi, L. Bini and P. Piomboni, ", "Title": "\"Protein pathways working in human follicular fluid: the future for tailored IVF?,\" ", "Journal": "Expert reviews in molecular medicine ", "Volume": "18 ", "Date": "May. 2016", "PubmedID": "PUBMED: 27149979; ", "DOI": "DOI 10.1017/erm.2016.4.", "Abstract": "The human follicular fluid (HFF) contains molecules and proteins that may affect follicle growth, oocyte maturation and competence acquiring. Despite the numerous studies, an integrated broad overview on biomolecular and patho/physiological processes that are proved or supposed to take place in HFF during folliculogenesis and oocyte development is still missing. In this review we report, for the first time, all the proteins unambiguously detected in HFF and, applying DAVID (Database for Annotation, Visualization and Integrated Discovery) and MetaCore bioinformatic resources, we shed new lights on their functional correlation, delineating protein patterns and pathways with reasonable potentialities for oocyte quality estimation in in vitro fertilisation (IVF) programs. Performing a rigorous PubMed search, we redacted a list of 617 unique proteins unambiguously-annotated as HFF components. Their functional processing suggested the occurrence in HFF of a tight and highly dynamic functional-network, which is balanced by specific effectors, primarily involved in extracellular matrix degradation and remodelling, inflammation and coagulation. Metalloproteinases, thrombin and vitamin-D-receptor/retinoid-X-receptor-alpha resulted as the main key factors in the nets and their differential activity may be indicative of ovarian health and oocyte quality. Despite future accurate clinical investigations are absolutely needed, the present analysis may provide a starting point for more accurate oocyte quality estimation and for defining personalised therapies in reproductive medicine. "}, {"Authors": "W. Kranc, J. Budna, A. Chachuła, S. Borys, A. Bryja, M. Rybska, S. Ciesiółka, E. Sumelka, M. Jeseta, KP. Brüssow, D. Bukowska, P. Antosik, M. Bruska, M. Nowicki, M. Zabel and B. Kempisty, ", "Title": "\"\"Cell Migration\" Is the Ontology Group Differentially Expressed in Porcine Oocytes Before and After In Vitro Maturation: A Microarray Approach.\", ", "Journal": "DNA and cell biology ", "Volume": "36(4) ", "Date": "Apr. 2017", "PubmedID": "PUBMED: 28384068; ", "DOI": "DOI 10.1089/dna.2016.3425.", "Abstract": "Maturation of cumulus-oocyte complexes (COCs) is crucial for further successful monospermic fertilization, embryo growth, and implantation. All these events are accompanied by proliferation and differentiation of cumulus cells. The migration of COCs to the oviduct after ovulation and the interaction between female gametes and/or embryos with maternal tissues are still poorly recognized on the molecular level. This study was aimed to first demonstrate the mRNA expression profile of cell migration markers during different stages of porcine oocytes maturation and developmental capability in vitro. The COCs were collected from a total of 45 pubertal crossbred Landrace gilts, brilliant cresyl blue (BCB) stained, and analyzed before (n = 150) or after (n = 150) in vitro maturation (IVM). Using the Affymetrix® Porcine Gene 1.1 ST Array, the expression profile of 12,258 porcine transcripts was examined. We found nine genes involved in cell migration mechanisms, that is, PLD1, KIT, LAMA2, MAP3K1, VEGFA, TGFBR3, INSR, TPM1, and RTN4. These genes were upregulated in porcine oocytes before IVM as compared with post-IVM expression analysis. Moreover, important mechanisms of biological interaction between VEGFA-KIT and VEGFA-INSR were also observed. The upregulation and/or downregulation of selected mRNAs expression after microarray assays was checked and approved by real-time quantitative polymerase chain reaction. We suggest that several genes, including LAMA2 or TPM1, encode proteins participating in the formation of the oocyte's protein architecture such as microtubules and kinetochore reorganization. As the expression of all \"migration regulatory genes\" investigated in this study was significantly upregulated in oocytes before IVM, we conclude that they may contribute to the maturational capability of porcine oocytes. However, migration potency of COCs is not accompanied by achievement of the MII stage by porcine oocytes in vitro. The investigated genes such as PLD1, KIT, LAMA2, MAP3K1, VEGFA, TGFBR3, INSR, TPM1, and RTN4 may be recognized as a new marker of porcine oocytes maturational competence during in vitro culture."}, {"Authors": "MF. Kragh, J. Rimestad, J. Berntsen and H. Karstoft, ", "Title": "\"Automatic grading of human blastocysts from time-lapse imaging.\", ", "Journal": "Computers in biology and medicine ", "Volume": "115 ", "Date": "Dec. 2019", "PubmedID": "PUBMED: 31630027; ", "DOI": "DOI 10.1016/j.compbiomed.2019.103494.", "Abstract": "Blastocyst morphology is a predictive marker for implantation success of in vitro fertilized human embryos. Morphology grading is therefore commonly used to select the embryo with the highest implantation potential. One of the challenges, however, is that morphology grading can be highly subjective when performed manually by embryologists. Grading systems generally discretize a continuous scale of low to high score, resulting in floating and unclear boundaries between grading categories. Manual annotations therefore suffer from large inter-and intra-observer variances."}, {"Authors": "E. Kresch, I. Efimenko, D. Gonzalez, PJ. Rizk and R. Ramasamy, ", "Title": "\"Novel methods to enhance surgical sperm retrieval: a systematic review.\", ", "Journal": "Arab journal of urology ", "Volume": "19(3) ", "Date": "2021", "PubmedID": "PUBMED: 34552774; ", "DOI": "DOI 10.1080/2090598X.2021.1926752.", "Abstract": "Objectives: To explore the use of novel technologies in sperm retrieval in men with azoospermia due to a production defect. Methods: We performed a Preferred Reporting Items for Systemic Reviews and Meta-Analysis (PRISMA)-compliant systemic literature review for manuscripts focussed on novel sperm-retrieval methods. We identified 30 studies suitable for qualitative analysis. Results and Conclusions: We identified multiple new promising technologies, each with its own distinct set of benefits and limitations, to enhance chances of sperm retrieval; these include the use of multiphoton microscopy, Raman spectroscopy, and full-field optical coherence tomography during a microdissection-testicular sperm extraction procedure. ORBEYE and ultrasonography technologies can also serve to better visualise areas of sperm production. Finally, artificial intelligence technology can play a role in the identification of sperm and, perhaps, better-quality sperm for use with assisted reproduction. Abbreviations: AI: artificial intelligence; ANN: artificial neural network; ART: assisted reproductive technology; 3D: three-dimensional; DNN: deep neural networks; FFOCT: full-field optical coherence tomography; H&E: haematoxylin and eosin; ICSI: intracytoplasmic sperm injection; IVF: in vitro fertilisation; MESA: micro-epididymal sperm aspiration; MeSH: Medical Subject Heading; MPM: multiphoton microscopy; (N)OA: (non-)obstructive azoospermia; SCO: Sertoli cell-only syndrome; SRR: sperm retrieval rates; TESA: testicular sperm aspiration; (micro-)TESE: (microdissection-) testicular sperm extraction; (CE)US: (contrast-enhanced) ultrasonography."}, {"Authors": "Z. Barnett-Itzhaki, M. Elbaz, R. Butterman, D. Amar, M. Amitay, C. Racowsky, R. Orvieto, R. Hauser, AA. Baccarelli and R. Machtinger, ", "Title": "\"Machine learning vs. classic statistics for the prediction of IVF outcomes.\", ", "Journal": "Journal of assisted reproduction and genetics ", "Volume": "37(10) ", "Date": "Oct. 2020", "PubmedID": "PUBMED: 32783138; ", "DOI": "DOI 10.1007/s10815-020-01908-1.", "Abstract": "To assess whether machine learning methods provide advantage over classic statistical modeling for the prediction of IVF outcomes."}, {"Authors": "R. Milewski, A. Kuczyńska, B. Stankiewicz and W. Kuczyński, ", "Title": "\"How much information about embryo implantation potential is included in morphokinetic data? A prediction model based on artificial neural networks and principal component analysis.\", ", "Journal": "Advances in medical sciences ", "Volume": "62(1) ", "Date": "Mar. 2017", "PubmedID": "PUBMED: 28384614; ", "DOI": "DOI 10.1016/j.advms.2017.02.001.", "Abstract": "The aim of this study was to answer the question of how much information about embryo implantation potential can be obtained from morphokinetic parameters through the creation a predictive model based on morphokinetic information and using advanced data-mining and artificial intelligence methods."}, {"Authors": "A. Chavez-Badiola, A. Flores-Saiffe Farias, G. Mendizabal-Ruiz, R. Garcia-Sanchez, AJ. Drakeley and JP. Garcia-Sandoval, ", "Title": "\"Predicting pregnancy test results after embryo transfer by image feature extraction and analysis using machine learning.\", ", "Journal": "Scientific reports ", "Volume": "10(1) ", "Date": "Mar. 2020", "PubmedID": "PUBMED: 32157183; ", "DOI": "DOI 10.1038/s41598-020-61357-9.", "Abstract": "Assessing the viability of a blastosyst is still empirical and non-reproducible nowadays. We developed an algorithm based on artificial vision and machine learning (and other classifiers) that predicts pregnancy using the beta human chorionic gonadotropin (b-hCG) test from both the morphology of an embryo and the age of the patients. We employed two high-quality databases with known pregnancy outcomes (n = 221). We created a system consisting of different classifiers that is feed with novel morphometric features extracted from the digital micrographs, along with other non-morphometric data to predict pregnancy. It was evaluated using five different classifiers: probabilistic bayesian, Support Vector Machines (SVM), deep neural network, decision tree, and Random Forest (RF), using a k-fold cross validation to assess the model's generalization capabilities. In the database A, the SVM classifier achieved an F1 score of 0.74, and AUC of 0.77. In the database B the RF classifier obtained a F1 score of 0.71, and AUC of 0.75. Our results suggest that the system is able to predict a positive pregnancy test from a single digital image, offering a novel approach with the advantages of using a small database, being highly adaptable to different laboratory settings, and easy integration into clinical practice."}, {"Authors": "Y. Wang, F. Moussavi and P. Lorenzen, ", "Title": "\"Automated embryo stage classification in time-lapse microscopy video of early human embryo development.\", ", "Journal": "Medical image computing and computer-assisted intervention : MICCAI ... International Conference on Medical Image Computing and Computer-Assisted Intervention ", "Volume": "16(Pt 2) ", "Date": "2013", "PubmedID": "PUBMED: 24579173; ", "DOI": "", "Abstract": "The accurate and automated measuring of durations of certain human embryo stages is important to assess embryo viability and predict its clinical outcomes in in vitro fertilization (IVF). In this work, we present a multi-level embryo stage classification method to identify the number of cells at every time point of a time-lapse microscopy video of early human embryo development. The proposed method employs a rich set of hand-crafted and automatically learned embryo features for classification and avoids explicit segmentation or tracking of individual embryo cells. It was quantitatively evaluated using a total of 389 human embryo videos, resulting in a 87.92% overall embryo stage classification accuracy."}, {"Authors": "CI. Lee, YR. Su, CH. Chen, TA. Chang, EE. Kuo, WL. Zheng, WT. Hsieh, CC. Huang, MS. Lee and M. Liu, ", "Title": "\"End-to-end deep learning for recognition of ploidy status using time-lapse videos.\", ", "Journal": "Journal of assisted reproduction and genetics ", "Volume": "38(7) ", "Date": "Jul. 2021", "PubmedID": "PUBMED: 34021832; ", "DOI": "DOI 10.1007/s10815-021-02228-8.", "Abstract": "Our retrospective study is to investigate an end-to-end deep learning model in identifying ploidy status through raw time-lapse video."}, {"Authors": "B. Liang, Y. Gao, J. Xu, Y. Song, L. Xuan, T. Shi, N. Wang, Z. Hou, YL. Zhao, WE. Huang and ZJ. Chen, ", "Title": "\"Raman profiling of embryo culture medium to identify aneuploid and euploid embryos.\", ", "Journal": "Fertility and sterility ", "Volume": "111(4) ", "Date": "Apr. 2019", "PubmedID": "PUBMED: 30683589; ", "DOI": "DOI 10.1016/j.fertnstert.2018.11.036.", "Abstract": "To develop and validate Raman metabolic footprint analysis to determine chromosome euploidy and aneuploidy in embryos fertilized in vitro."}, {"Authors": "Y. Hao, Z. Zhang, D. Han, Y. Cao, P. Zhou, Z. Wei, M. Lv and D. Chen, ", "Title": "\"Gene expression profiling of human blastocysts from in vivo and 'rescue IVM' with or without melatonin treatment.\", ", "Journal": "Molecular medicine reports ", "Volume": "16(2) ", "Date": "Aug. 2017", "PubmedID": "PUBMED: 28627630; ", "DOI": "DOI 10.3892/mmr.2017.6742.", "Abstract": "To evaluate the effect of melatonin supplementation in maturation medium for human 'rescue IVM' and investigate differences in transcriptomic profile of blastocysts developed from oocytes matured in vitro with/without melatonin treatment and in vivo, a total of 314 GV oocytes and 320 MI oocytes were collected from 200 patients younger than 35 years old undergoing ICSI cycle. The oocytes were randomly distributed in the control group (no melatonin) and four other groups of varying melatonin concentrations (10‑11, 10‑9, 10‑7, 10‑5 mol/l). Gene profiling was performed on blastocysts developed from in vivo maturation oocytes (in vivo group), and in vitro maturation (IVM) oocytes with an optimal concentration of melatonin treatment (IVM‑anti group) or without melatonin (IVM group). The ratio of high quality blastocysts was significantly higher in the groups treated with 10‑5 mol/l melatonin compared with others groups. The large‑scale analysis of the transcriptome revealed significant differences in mRNA expression levels. In each group, nine blastocysts were selected for gene expression profiling. The differentially expressed genes were involved in cysteine and methionine metabolism, regulation of apoptotic process, mineral absorption, steroid hormone biosynthesis, Wnt signaling, p53 signaling pathway and other functions. The findings indicated that the IVM procedure may potentially affect DNA methylation and the canonical Wnt signaling pathway. Exogenous melatonin positively influenced quality of blastocysts, which may be mediated via upregulation of p53 signaling and correcting DNA methylation changes caused by 'rescue IVM'. However, this study reflected what was generally referred to as 'rescue IVM' and was not a true reflection of clinical IVM techniques. Therefore, melatonin required further investigation as a promising supplement for use in IVM."}, {"Authors": "CL. Lu, ZQ. Yan, XL. Song, YY. Xu, XY. Zheng, R. Li, P. Liu, HL. Feng and J. Qiao, ", "Title": "\"Effect of exogenous gonadotropin on the transcriptome of human granulosa cells and follicular fluid hormone profiles.\", ", "Journal": "Reproductive biology and endocrinology : RB&E ", "Volume": "17(1) ", "Date": "Jun. 2019", "PubmedID": "PUBMED: 31234873; ", "DOI": "DOI 10.1186/s12958-019-0489-4.", "Abstract": "Superovulation treatment had some adverse effects on maturity and development of oocytes. Can superovulation dose of gonadotropins (Gns) affect the transcriptome of granulosa cells and follicular fluid (FF) hormone levels?"}, {"Authors": "E. Santos Filho, JA. Noble, M. Poli, T. Griffiths, G. Emerson and D. Wells, ", "Title": "\"A method for semi-automatic grading of human blastocyst microscope images.\", ", "Journal": "Human reproduction (Oxford, England) ", "Volume": "27(9) ", "Date": "Sep. 2012", "PubmedID": "PUBMED: 22736327; ", "DOI": "DOI 10.1093/humrep/des219.", "Abstract": "The precise assessment of embryo viability is an extremely important factor for the optimization of IVF treatments. In order to assess embryo viability, several embryo scoring systems have been developed. However, they rely mostly on a subjective visual analysis of embryo morphological features and thus are subject to inter- and intra-observer variation. In this paper, we propose a method for image segmentation (the dividing of an image into its meaningful constituent regions) and classification of human blastocyst images with the aim of automating embryo grading."}, {"Authors": "A. Targosz, P. Przystałka, R. Wiaderkiewicz and G. Mrugacz, ", "Title": "\"Semantic segmentation of human oocyte images using deep neural networks.\", ", "Journal": "Biomedical engineering online ", "Volume": "20(1) ", "Date": "Apr. 2021", "PubmedID": "PUBMED: 33892725; ", "DOI": "DOI 10.1186/s12938-021-00864-w.", "Abstract": "Infertility is a significant problem of humanity. In vitro fertilisation is one of the most effective and frequently applied ART methods. The effectiveness IVF depends on the assessment and selection of gametes and embryo with the highest developmental potential. The subjective nature of morphological assessment of oocytes and embryos is still one of the main reasons for seeking effective and objective methods for assessing quality in automatic manner. The most promising methods to automatic classification of oocytes and embryos are based on image analysis aided by machine learning techniques. The special attention is paid on deep neural networks that can be used as classifiers solving the problem of automatic assessment of the oocytes/embryos."}, {"Authors": "SG. Goodson, Z. Zhang, JK. Tsuruta, W. Wang and DA. O'Brien, ", "Title": "\"Classification of mouse sperm motility patterns using an automated multiclass support vector machines model.\", ", "Journal": "Biology of reproduction ", "Volume": "84(6) ", "Date": "Jun. 2011", "PubmedID": "PUBMED: 21349820; ", "DOI": "DOI 10.1095/biolreprod.110.088989.", "Abstract": "Vigorous sperm motility, including the transition from progressive to hyperactivated motility that occurs in the female reproductive tract, is required for normal fertilization in mammals. We developed an automated, quantitative method that objectively classifies five distinct motility patterns of mouse sperm using Support Vector Machines (SVM), a common method in supervised machine learning. This multiclass SVM model is based on more than 2000 sperm tracks that were captured by computer-assisted sperm analysis (CASA) during in vitro capacitation and visually classified as progressive, intermediate, hyperactivated, slow, or weakly motile. Parameters associated with the classified tracks were incorporated into established SVM algorithms to generate a series of equations. These equations were integrated into a binary decision tree that sequentially sorts uncharacterized tracks into distinct categories. The first equation sorts CASA tracks into vigorous and nonvigorous categories. Additional equations classify vigorous tracks as progressive, intermediate, or hyperactivated and nonvigorous tracks as slow or weakly motile. Our CASAnova software uses these SVM equations to classify individual sperm motility patterns automatically. Comparisons of motility profiles from sperm incubated with and without bicarbonate confirmed the ability of the model to distinguish hyperactivated patterns of motility that develop during in vitro capacitation. The model accurately classifies motility profiles of sperm from a mutant mouse model with severe motility defects. Application of the model to sperm from multiple inbred strains reveals strain-dependent differences in sperm motility profiles. CASAnova provides a rapid and reproducible platform for quantitative comparisons of motility in large, heterogeneous populations of mouse sperm."}, {"Authors": "R. Milewski, J. Jamiołkowski, J. Milewska Anna, J. Domitrz, J. Szamatowicz and S. Wołczyński, ", "Title": "\"Prognosis of the IVF ICSI/ET procedure efficiency with the use of artificial neural networks among patients of the Department of Reproduction and Gynecological Endocrinology.\", ", "Journal": "Ginekologia polska ", "Volume": "80(12) ", "Date": "Dec. 2009", "PubmedID": "PUBMED: 20120934; ", "DOI": "", "Abstract": "Prognosis of pregnancy for patients treated with IVF ICSI/ET methods, using artificial neural networks."}, {"Authors": "AS. Joshi, AD. Alegria, B. Auch, K. Khosla, JB. Mendana, K. Liu, J. Bischof, DM. Gohl and SB. Kodandaramaiah, ", "Title": "\"Multiscale, multi-perspective imaging assisted robotic microinjection of 3D biological structures.\", ", "Journal": "Annual International Conference of the IEEE Engineering in Medicine and Biology Society. IEEE Engineering in Medicine and Biology Society. Annual International Conference ", "Volume": "2021 ", "Date": "Nov. 2021", "PubmedID": "PUBMED: 34892294; ", "DOI": "DOI 10.1109/EMBC46164.2021.9630858.", "Abstract": "Microinjection is a widely used technique employed by biologists with applications in transgenesis, cryopreservation, mutagenesis, labeling/dye injection and in-vitro fertilization. However, microinjection is an extremely laborious manual procedure, which makes it a critical bottleneck in the field and thus ripe for automation. Here, we present a computer-guided robot that automates the targeted microinjection of Drosophila melanogaster and zebrafish (Danio rerio) embryos, two important model organisms in biological research. The robot uses a series of cameras to image an agar plate containing embryos at multiple magnifications and perspectives. This imaging is combined with machine learning and computer vision algorithms to pinpoint a location on the embryo for targeted microinjection with microscale precision. We demonstrate the utility of this microinjection robot to successfully microinject Drosophila melanogaster and zebrafish embryos. Results obtained indicate that the robotic microinjection approach can significantly increase the throughput of microinjection as compared to manual microinjection while maintaining survival rates comparable to human operators. In the future, this robotic platform can be used to perform high throughput microinjection experiments and can be extended to automatically microinject a host of organisms such as roundworms (Caenorhabditis elegans), mosquito (Culicidae) embryos, sea urchins (Echinoidea) and frog (Xenopus) oocytes."}, {"Authors": "R. Mestre, T. Patiño and S. Sánchez, ", "Title": "\"Biohybrid robotics: From the nanoscale to the macroscale.\", ", "Journal": "Wiley interdisciplinary reviews. Nanomedicine and nanobiotechnology ", "Volume": "13(5) ", "Date": "Sep. 2021", "PubmedID": "PUBMED: 33533200; ", "DOI": "DOI 10.1002/wnan.1703.", "Abstract": "Biohybrid robotics is a field in which biological entities are combined with artificial materials in order to obtain improved performance or features that are difficult to mimic with hand-made materials. Three main level of integration can be envisioned depending on the complexity of the biological entity, ranging from the nanoscale to the macroscale. At the nanoscale, enzymes that catalyze biocompatible reactions can be used as power sources for self-propelled nanoparticles of different geometries and compositions, obtaining rather interesting active matter systems that acquire importance in the biomedical field as drug delivery systems. At the microscale, single enzymes are substituted by complete cells, such as bacteria or spermatozoa, whose self-propelling capabilities can be used to transport cargo and can also be used as drug delivery systems, for in vitro fertilization practices or for biofilm removal. Finally, at the macroscale, the combinations of millions of cells forming tissues can be used to power biorobotic devices or bioactuators by using muscle cells. Both cardiac and skeletal muscle tissue have been part of remarkable examples of untethered biorobots that can crawl or swim due to the contractions of the tissue and current developments aim at the integration of several types of tissue to obtain more realistic biomimetic devices, which could lead to the next generation of hybrid robotics. Tethered bioactuators, however, result in excellent candidates for tissue models for drug screening purposes or the study of muscle myopathies due to their three-dimensional architecture. This article is categorized under: Therapeutic Approaches and Drug Discovery > Emerging Technologies Nanotechnology Approaches to Biology > Nanoscale Systems in Biology."}, {"Authors": "C. Si, N. Wang, M. Wang, Y. Liu, Z. Niu and Z. Ding, ", "Title": "\"TMT-based proteomic and bioinformatic analyses of human granulosa cells from obese and normal-weight female subjects.\", ", "Journal": "Reproductive biology and endocrinology : RB&E ", "Volume": "19(1) ", "Date": "May. 2021", "PubmedID": "PUBMED: 34016141; ", "DOI": "DOI 10.1186/s12958-021-00760-x.", "Abstract": "Increasing evidence supports a relationship between obesity and either infertility or subfertility in women. Most previous omics studies were focused on determining if the serum and follicular fluid expression profiles of subjects afflicted with both obesity-related infertility and polycystic ovary syndrome (PCOS) are different than those in normal healthy controls. As granulosa cells (GCs) are essential for oocyte development and fertility, we determined here if the protein expression profiles in the GCs from obese subjects are different than those in their normal-weight counterpart."}, {"Authors": "S. Liao, W. Pan, WQ. Dai, L. Jin, G. Huang, R. Wang, C. Hu, W. Pan and H. Tu, ", "Title": "\"Development of a Dynamic Diagnosis Grading System for Infertility Using Machine Learning.\", ", "Journal": "JAMA network open ", "Volume": "3(11) ", "Date": "Nov. 2020", "PubmedID": "PUBMED: 33165608; ", "DOI": "DOI 10.1001/jamanetworkopen.2020.23654.", "Abstract": "Many indicators need to be considered when judging the condition of patients with infertility, which makes diagnosis and treatment complicated."}]